[
    {
        "title": "Central Library Orientation 2025",
        "start": "2025-08-04T10:00:00",
        "end": "2025-08-08T10:00:00",
        "extendedProps": {
            "description": "Detailed Library Orientation Program for new entrants and senior students interested in learning more about library resources and services.  Covers access to digital resources, research support, and library events.",
            "venue": "Conference Hall, 2nd Floor, Central Library",
            "organisingBody": "Central Library",
            "contact": "+91-22-2576-8936 / 8926"
        }
    },
    {
        "title": "Roshni: Bringing the Light of Rural Artistry",
        "start": "2025-08-04T11:00:00",
        "end": "2025-08-05T11:00:00",
        "extendedProps": {
            "description": "An initiative by the Group for Rural Activities (GRA) to connect students with rural Indian artisans.  Features online ordering and an offline exhibition of handcrafted items like Bamboo Rakhis, Key Chains, Notebooks, Side Bags, Jewellery, etc.  Proceeds support rural artisans and promote sustainable crafts.",
            "venue": "Hostels 10, 11, and 15 mess areas (7:30 PM to 9:30 PM), Staff Canteen (11:00 AM to 5:00 PM)",
            "organisingBody": "Group for Rural Activities (GRA), IIT Bombay",
            "contact": "9831876729 || 7850869073"
        }
    },
    {
        "title": "ShARE IITB Orientation",
        "start": "2025-08-03T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Orientation for ShARE IITB, a student-run leadership and consulting organization.  Includes information about their recruitment process, a guest speaker (Jahnvi Nandwani), fun activities, and prizes. Winners of ShARE's Business Challenge will be announced.",
            "venue": "LT-PCSA",
            "organisingBody": "ShARE IITB, UGAC",
            "contact": "https://www.shareiitb.org/"
        }
    },
    {
        "title": "Student Vaccination Drive",
        "start": "2025-08-03T09:15:00",
        "end": "2025-08-03T09:15:00",
        "extendedProps": {
            "description": "Vaccination drive for students.  MMR, Chicken Pox, Typhoid, and Hepatitis A vaccines are offered. Paid basis (Administration Charges + Vaccine Charges). Online payment only.  Verification of vaccine records for new students.",
            "venue": "Hospital new OPD wing",
            "organisingBody": "Bha.Prau.San. Hospital, CMO(SAG)",
            "contact": "Dr. Arvind Meshram"
        }
    },
    {
        "title": "Inter IIT Tech Meet 14.0",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The largest annual tech showdown among all IITs—featuring mind-bending competitions, cutting-edge innovation, entrepreneurial brilliance, and tech-for-impact challenges.",
            "venue": null,
            "organisingBody": "Institute Technical Council, IIT Bombay",
            "contact": "+91 91460 50850"
        }
    },
    {
        "title": "Free Webinar for students looking to pursue higher studies in Germany",
        "start": "2025-08-06T16:00:00",
        "end": "NoneT16:00:00",
        "extendedProps": {
            "description": "Step-by-step admission process through the new Consular Service Portal\nOverview of preparatory programs for international students\nInformation on visa procedures, scholarships, and tuition\nOpportunity to ask questions live to our team",
            "venue": "Online",
            "organisingBody": "German Consulate General, Mumbai & Indian Institute of Technology (IIT) Bombay",
            "contact": "Rebecca Jadin, +91-22-21593069, http://www.ir.iitb.ac.in"
        }
    },
    {
        "title": "iGEM IIT Bombay Education Outreach Tech Team Recruitment",
        "start": "NoneTNone",
        "end": "2025-08-12TNone",
        "extendedProps": {
            "description": "Recruitment for sophomores (B.Tech, B.Des, and B.S. students) for two key roles within the Education Outreach Subsystem: Visual Communicator and Website UI/UX Designer.  No prior experience needed.",
            "venue": null,
            "organisingBody": "iGEM IIT Bombay",
            "contact": "+91 93405 94582 & +91 70233 89911"
        }
    },
    {
        "title": "LRWC Support Courses for Autumn Semester 2025",
        "start": "2025-08-04T13:00:00",
        "end": "2025-08-08T13:00:00",
        "extendedProps": {
            "description": "Language support courses offered by the Language Resource and Writing Centre (LRWC) including Academic Speaking for Researchers, Foundations of Academic Speaking, and Essentials for Academic Writing.  Personalized consultations also available.",
            "venue": "LRWC Desk (24x7 Reading Hall, Central Library)",
            "organisingBody": "Language Resource and Writing Centre (LRWC)",
            "contact": "lrwcinstructor@iitb.ac.in"
        }
    },
    {
        "title": "Condolence Meeting for Mr Rohit Sinha",
        "start": "2025-08-04T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A condolence meeting for Mr Rohit Sinha, who passed away recently, is scheduled.",
            "venue": "LA 001",
            "organisingBody": "Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay",
            "contact": "Dr. Ajay Singh Panwar, Head, Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay, Phone: +91-22-2576 7600"
        }
    },
    {
        "title": "e-Yantra Robotics Competition (eYRC 2025-26)",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "e-Yantra Robotics Competition (eYRC 2025-26) is IIT Bombay's signature Project-Based Learning (PBL) robotics competition, now open for registrations. It invites participants to showcase talents in robotics and engineering, involving technologies such as Robot Operating System (ROS), Drone Control, Image Processing, 3D Designing, Embedded Systems, Control Systems Design, Field Programmable Gate Arrays (FPGAs) Programming, and Reinforcement Learning.",
            "venue": null,
            "organisingBody": "e-Yantra, IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Basic First Aid and CPR Training",
        "start": "2025-08-09T11:00:00",
        "end": "2025-08-09T11:00:00",
        "extendedProps": {
            "description": "Join us for a hands-on Basic First Aid and CPR Training session organized by the Fire & Safety Section, Office of Dean (IPS). This is a great opportunity to equip yourself with life-saving skills and be prepared to act in emergencies. The first 50 registrants will secure their spot on a first-come, first-served basis. This Raksha Bandhan, let us extend the bond of protection beyond tradition, by learning CPR and being there for someone when it matters most.",
            "venue": null,
            "organisingBody": "Fire & Safety Section, Office of Dean (IPS), Indian Institute of Technology Bombay",
            "contact": "Amit Kumar, Technical Officer, Fire and Safety Section, Office of Dean (IPS), IIT Bombay, Telephone: +91-22 21593050"
        }
    },
    {
        "title": "Independence Day Programme 2025",
        "start": "2025-08-15TNone",
        "end": "2025-08-15TNone",
        "extendedProps": {
            "description": "Official announcement for the Independence Day Programme and celebrations, inviting all to attend in person or via live webcast.",
            "venue": null,
            "organisingBody": "IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Samadhan 2025 – National Social Innovation Challenge",
        "start": "2025-08-18TNone",
        "end": "2025-11-08TNone",
        "extendedProps": {
            "description": "A national-level social innovation challenge organized by UPAY NGO, in collaboration with GRA, IIT Bombay. Participants form teams of 2-4 students to propose and refine solutions for real-world issues faced by street children across India, with mentorship from industry experts. Top teams will pitch at a national stage, with opportunities for cash prizes and potential implementation. Not open to UG Freshers (2025 UG entrants).",
            "venue": null,
            "organisingBody": "UPAY NGO, GRA, IIT Bombay",
            "contact": "Archishman Ray, Tanushree (Overall Coordinators, GRA, IIT Bombay), Phone: 9831876729, 7850869073"
        }
    },
    {
        "title": "Shashwat Panda Memorial Lecture",
        "start": "2025-08-08T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A lecture by Ms. Rama Bijapurkar titled 'Understanding India's Household Consumption Story'.",
            "venue": "PC Saxena Auditorium",
            "organisingBody": "Office of Dean ACR",
            "contact": null
        }
    },
    {
        "title": "Fine Arts NOCS Trials",
        "start": "2025-08-06T18:30:00",
        "end": "2025-08-06T18:30:00",
        "extendedProps": {
            "description": "Important update regarding the Fine Arts NOCS trials previously announced. The trials will now be held only on 6th August 2025 from 6:30 PM to 8:00 PM at LC 301, Lecture Complex. Please note that there will be no trials on 7th August as mentioned earlier.",
            "venue": "LC 301, Lecture Complex",
            "organisingBody": "Institute Cultural Council",
            "contact": "Omprakash Chaturvedi (NSO Cultural Coordinator) - 7972643853"
        }
    },
    {
        "title": "QuantFest'25",
        "start": "2025-08-24T10:00:00",
        "end": "2025-08-24T13:00:00",
        "extendedProps": {
            "description": "QuantFest '25 is an analytical thinking and probability-based challenge competition inspired by top quant firms. It includes Prelims on August 24, 2025, focusing on Probability, Puzzles, and Logical Reasoning, and Regionals on September 27, 2025, a simulation-style round for top performers. Registration deadline is August 7, 2025.",
            "venue": "On-campus (venue TBA)",
            "organisingBody": "Technical Affairs, IIT Bombay",
            "contact": "Siva Madhav Chinta: +91 8639147440, Prabhat Dubey: +91 9076373141, Shahu Patil: +91 91460 50850"
        }
    },
    {
        "title": "BioFront Symposium 2k25: Unveiling New Frontiers of Biotech",
        "start": "2025-08-09TNone",
        "end": "2025-08-10TNone",
        "extendedProps": {
            "description": "A pan-India online symposium hosted by BioX, IIT Bombay, exploring the convergence of biotechnology with engineering, AI, data science, nanotech, and material sciences. Features keynote talks by leading researchers and industry experts, interactive sessions, and thematic panel discussions on emerging domains like Neuroscience, Health-tech, Bioinformatics, and Nano-tech.",
            "venue": "Online (MS Teams)",
            "organisingBody": "BioX, IIT Bombay, in collaboration with Biotech Club – IIT Madras, Science Club – IISER Pune, BioNexus – SRMIST, and Genesys – NIT Rourkela",
            "contact": "Gaurish Khodke, BioX Manager 25-26 (+91 9766206523); Shahu Patil, General Secretary Technical Affairs 25-26, IIT Bombay (+91 91460 50850)"
        }
    },
    {
        "title": "Har Ghar Tiranga Campaign 2025",
        "start": "2025-08-13TNone",
        "end": "2025-08-15TNone",
        "extendedProps": {
            "description": "Independence Day 2025 'Har Ghar Tiranga' campaign encouraging campus residents to hoist flags and post selfies on harghartiranga.com (Aug 13-15, 2025). A selfie booth will be at the Institute Arch on Aug 15, 2025. A national online quiz on MyGov (quiz.mygov.in) offers certificates and cash prizes.",
            "venue": "IIT Bombay Campus (Institute Arch for selfie booth) and Online platforms",
            "organisingBody": "Indian Institute of Technology Bombay",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, IIT Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "Vartalap - Let's Talk: Balancing Books and Being",
        "start": "2025-08-08T19:00:00",
        "end": "2025-08-08T19:00:00",
        "extendedProps": {
            "description": "This month's Vartalap session, titled 'BALANCING BOOKS AND BEING: Growing Through Change in Academic Life', is a reflective session dedicated to helping students navigate transitions, support mental wellness, and find steadiness in academic life. Part of a monthly expert-led series on mental health and wellness, Vartalap provides a space to pause, listen, and explore themes like well-being, relationships, and personal growth through honest conversation, not a lecture. It is open to all students, whether new or established.",
            "venue": "LC-102, Lecture Hall Complex - 1",
            "organisingBody": "Team SWC, IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Beginner and Intermediate Swimming Camp",
        "start": "2024-08-08T07:15:00",
        "end": "2024-08-18T07:15:00",
        "extendedProps": {
            "description": "A series of Aquatics Camps by the Institute Sports Council offering swimming lessons from a respected coach. Camps include Intermediate (7:15 AM - 8:00 AM, Basic Freestyle required), Girls Beginners (5:30 PM - 6:15 PM), and Boys Beginner (7:00 PM - 7:45 PM), each with 30 seats and a fee of Rs 100/-.",
            "venue": null,
            "organisingBody": "Institute Sports Council",
            "contact": "Meet Vanja, 9323587701"
        }
    },
    {
        "title": "Careers in Astronomy & Astrophysics",
        "start": "NoneT19:30:00",
        "end": "NoneT19:30:00",
        "extendedProps": {
            "description": "Krittika, the Astronomy Club of IIT Bombay, invites you to a Q&A panel discussion for all those curious about turning their passion for astronomy and astrophysics into a career. Learn about the diverse paths the field offers, hear firsthand experiences from those who’ve pursued it and get your questions answered by professionals in the domain.",
            "venue": "Seminar Hall, 2nd Floor, Physics Dept.",
            "organisingBody": "Krittika, the Astronomy Club of IIT Bombay",
            "contact": "Yash Palwe (99709 73860), Anvit Khade (99877 99311), Shahu Patil (+91 91460 50850)"
        }
    },
    {
        "title": "Institute Technical Summer Projects (ITSP) Exhibition 2025",
        "start": "2025-08-09T14:00:00",
        "end": "2025-08-09T14:00:00",
        "extendedProps": {
            "description": "Invitation to one of the coolest events kicking off the tech scene at IIT Bombay, showcasing amazing student projects from AI and robotics to drones and design, built as part of the ITSP program. Attendees can explore innovative ideas, chat with project teams, learn how things were built from scratch, and spark ideas for future projects.",
            "venue": "Convocation Hall Foyer",
            "organisingBody": "Institute Technical Council",
            "contact": "Gaurish (9766206523), Aniket (6205741275), Sumedh (7588055255), Veeraditya (9449007525), Shahu Patil (+91 91460 50850)"
        }
    },
    {
        "title": "Institute Technical Council (ITC) UG & PG Freshers Orientation",
        "start": "2025-08-09T14:00:00",
        "end": "NoneT14:00:00",
        "extendedProps": {
            "description": "Welcome to IIT Bombay! The Institute Technical Council (ITC) invites UG & PG Freshers to their orientation, serving as the first step into IITB's vibrant tech world. This event marks the beginning of your journey with 9 diverse Technical Clubs (robotics, coding, astronomy, energy science, mathematics, Biotech, etc.). It's a gateway to discover where you belong, offering a firsthand look at IITB's tech scene, interaction with club members, and insights into involvement opportunities, hands-on learning, competitions, and projects designed to spark creativity and technical growth. Attendees can also expect cool freebies by arriving early.",
            "venue": "Convocation Hall",
            "organisingBody": "Institute Technical Council (ITC), IIT Bombay",
            "contact": "Shahu Patil, General Secretary Technical Affairs 25-26, IIT Bombay, +91 91460 50850"
        }
    },
    {
        "title": "Independence Day 2025 Celebrations",
        "start": "2025-08-15T09:00:00",
        "end": "2025-08-15T09:00:00",
        "extendedProps": {
            "description": "Announcement of Mr. Rajeev M. Pandia, a distinguished alumnus, as the Chief Guest for Independence Day 2025 celebrations at IIT Bombay. The email highlights his extensive career in the chemical industry and significant contributions.",
            "venue": "Institute Arch",
            "organisingBody": "Indian Institute of Technology Bombay (IIT Bombay)",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "National Librarian's Day Celebrations",
        "start": "2025-08-12T11:00:00",
        "end": "NoneT11:00:00",
        "extendedProps": {
            "description": "Invitation to celebrate National Librarian's Day, featuring a special talk by Dr. Jagdish Arora on 'Beyond the Books and Journals: Role of AI in the Future of Academic Libraries'.",
            "venue": "Conference Hall, Central Library, IIT Bombay",
            "organisingBody": "Central Library, IIT Bombay",
            "contact": "Chief Library Officer, Central Library, IIT Bombay, Powai, Mumbai - 400 076, Email: office.library@iitb.ac.in, Phone: 022 2576 8921"
        }
    },
    {
        "title": "Inter IIT Pre Camp Cricket Trials",
        "start": "2025-08-24T10:00:00",
        "end": "2025-08-24T13:00:00",
        "extendedProps": {
            "description": "The Institute Sports Council announces Inter IIT Pre Camp PG and UG cricket trials. PG trials are on Sunday, August 17th, and UG trials on Sunday, August 24th, both commencing promptly at 10 am at the Indoor Cricket Courts. Participants must bring appropriate sports shoes and batters require abdomen support. Registration is mandatory via the provided Google Form.",
            "venue": "Indoor Cricket Courts",
            "organisingBody": "Institute Sports Council",
            "contact": "Pradyumna Gugulothu (Institute Cricket Secretary): 7103954490"
        }
    },
    {
        "title": "Shashwat Panda Memorial Lecture",
        "start": "2025-08-08T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Ms. Rama Bijapurkar will deliver a lecture on Understanding India’s Household Consumption Story.",
            "venue": "PC Saxena Auditorium",
            "organisingBody": "Office of Dean ACR",
            "contact": null
        }
    },
    {
        "title": "Careers in Astronomy & Astrophysics",
        "start": "2025-08-07T19:30:00",
        "end": "2025-08-07T19:30:00",
        "extendedProps": {
            "description": "Krittika, the Astronomy Club of IIT Bombay, invites you to a Q&A panel discussion for all those curious about turning their passion for astronomy and astrophysics into a career. Learn about the diverse paths the field offers, hear firsthand experiences from those who’ve pursued it and get your questions answered by professionals in the domain. Meet Our Panelists: - Gaurav Waratkar – Postdoctoral researcher at Caltech, specializing in high-energy astrophysics, astronomical instrumentation, and gravitational wave transients. - Praveer Tiwari – Postdoctoral researcher at IIT Bombay, with expertise in supermassive black holes, gravitational waves, and nuclear astrophysics. - Yogesh Wagh – PhD at Liverpool John Moores University (LJMU), working on near-Earth asteroid detection, gamma-ray burst (GRB) afterglows, and scheduling algorithms for gravitational wave follow-ups. - Sameer Patil – Phd at STARLAB, he is a technologist turned Astrophysicist with 25 years of software experience at firms like Morgan Stanley, MCSI and Google, he is now doing research in 21 cm cosmology, GRBs and use of AI/ML techniques in Astrophysics.",
            "venue": "Seminar Hall, 2nd Floor, Physics Dept.",
            "organisingBody": "Krittika, the Astronomy Club of IIT Bombay",
            "contact": "Yash Palwe: 99709 73860, Anvit Khade: 99877 99311"
        }
    },
    {
        "title": "NSS Department Orientation for NOCS students",
        "start": "NoneT09:30:00",
        "end": "NoneT09:30:00",
        "extendedProps": {
            "description": "Greetings from NSS IIT Bombay! Are you ready to step into a journey that blends purpose with passion? To introduce you to the joy of volunteering and making real-world impact, NSS IIT Bombay is conducting a Department Orientation. This session will walk you through our wide range of initiatives, show you how each department contributes to meaningful change, and help you find your place in this movement. Mandatory for all freshers who selected NSS as NOCS 1st or 2nd preference. Others who are curious and passionate are warmly welcome too! Exciting freebies await you… But the real reward? Discovering how you can help change lives — starting with your own. Join the WhatsApp group for regular updates about the same - https://chat.whatsapp.com/GUajfMHNYliFHMNVVOOsAK",
            "venue": "LH102",
            "organisingBody": "NSS IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "XLR8 Orientation",
        "start": "2025-08-09T16:30:00",
        "end": "NoneT16:30:00",
        "extendedProps": {
            "description": "Join the Electronics & Robotics Club (ERC) for the XLR8 Orientation, IIT Bombay’s largest tech event. This session offers a firsthand look at robotics and electronics, featuring a dynamic obstacle course challenge and a hands-on workshop to build your own WiFi-controlled bot from scratch. Expect exciting surprises and a memorable session, perfect for beginners and curious minds.",
            "venue": "LA 002",
            "organisingBody": "Electronics and Robotics Club",
            "contact": "Saravan Kumar: +918247227509, Srivathsa Thotakura: +919137164841"
        }
    },
    {
        "title": "नशा मुक्त भारत पखवाड़ा (Drug-Free India Fortnight)",
        "start": "2025-08-15TNone",
        "end": "2025-08-16TNone",
        "extendedProps": {
            "description": "The Narcotics Control Bureau (NCB) has organised a nation-wide campaign, 'नशा मुक्त भारत पखवाड़ा', during August 15-16, 2025, to promote a drug-free India. All campus residents are requested to participate by taking the e-pledge against drug abuse via the provided link: https://nmba.dosje.gov.in/content/take-a-pledge. Download your pledge certificate upon completion.",
            "venue": "Online",
            "organisingBody": "Narcotics Control Bureau (NCB)",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, IIT Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "IRCC's TechConnect Logo Design Competition",
        "start": "2025-07-29TNone",
        "end": "2025-08-18TNone",
        "extendedProps": {
            "description": "A logo design competition for the upcoming IIT Bombay- IRCC's TechConnect. Open to students, staff, and faculty to contribute innovative designs for TechConnect's identity. Details and submission via provided links (Flyer, Guidelines, Registration Form).",
            "venue": null,
            "organisingBody": "IRCC, IIT Bombay (Office of Dean R&D)",
            "contact": "dean.rnd.office@iitb.ac.in"
        }
    },
    {
        "title": "HPCL-IITB Energy Transition Challenge",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The HPCL-IITB Energy Transition Challenge aims to engage students, startups, researchers, and refinery professionals in ideating practical, scalable, and disruptive solutions for decarbonizing refinery operations and processes, under the theme 'Energy Transition in Refineries through Innovation'. Participants can win cash prizes up to ₹60,000.",
            "venue": null,
            "organisingBody": "Hindustan Petroleum Corporation Limited (HPCL), Research Hub for Green Energy and Sustainability (GESH IITB), Centre of Excellence in Oil, Gas, and Energy (CoE-OGE IITB)",
            "contact": "Ms. Jaya K, Senior Associate - Entrepreneurship, GESH IITB, 30006497@iitb.ac.in"
        }
    },
    {
        "title": "Institute Technical Council (ITC) UG & PG Freshers Orientation",
        "start": "2025-08-09T14:00:00",
        "end": "2025-08-09T14:00:00",
        "extendedProps": {
            "description": "Welcome to IIT Bombay! This orientation is your first step into the vibrant world of tech at IITB, marking the beginning of your journey with 9 diverse Technical Clubs under ITC (covering fields like robotics, coding, astronomy, energy science, mathematics, Biotech and more). This is your chance to discover where you belong now. Get a firsthand look at how the tech scene at IITB works, interact with club members, and discover how to get involved. We’ll also walk you through opportunities for hands-on learning, competitions, and projects — all designed to spark your creativity and technical growth.",
            "venue": "Convocation Hall",
            "organisingBody": "Institute Technical Council (ITC), IIT Bombay",
            "contact": "Shahu Patil, General Secretary Technical Affairs, IIT Bombay; +91 91460 50850; gsectech@iitb.ac.in"
        }
    },
    {
        "title": "Extended Services of SWC: One-on-one Emotional Support",
        "start": "2025-08-09T10:00:00",
        "end": "2025-08-10T10:00:00",
        "extendedProps": {
            "description": "Counsellor will be available for one-on-one emotional support at the SWC Office. Students can walk-in or contact via phone/email during specified hours. The Student Wellness Centre encourages students to utilize available support for emotional well-being. Emergency contact information and an online counselling platform are also provided.",
            "venue": "SWC Office (Nandan Nilekani Main Building, 3rd floor)",
            "organisingBody": "Student Wellness Centre, IIT Bombay",
            "contact": "wellness@iitb.ac.in"
        }
    },
    {
        "title": "Resume-Building Session with Industry Leader",
        "start": "2025-08-10T11:00:00",
        "end": "2025-08-10T11:00:00",
        "extendedProps": {
            "description": "The resume-building session for PG (masters or PhD) final year students sitting for placements will teach how to craft a resume that stands out. PG students will receive 1 incentive point for attending from 10:50 AM till the end. Open to all final year PG students.",
            "venue": "LA 201",
            "organisingBody": "PG-CAMP team",
            "contact": "Priyanka Talwar, General Secretary Academic Affairs (PG), Post Graduate Council for Academics and Mentoring Programmes, Indian Institute of Technology Bombay, Powai, Mumbai - 400076. Email: gsecaapg@iitb.ac.in, Contact: +91 8637313704"
        }
    },
    {
        "title": "Iyengar Yoga | Weekly Morning Sessions",
        "start": "NoneT06:15:00",
        "end": "NoneT06:15:00",
        "extendedProps": {
            "description": "Yogastha invites you to weekly morning Iyengar Yoga sessions focusing on precision, alignment, and strength, guided by an experienced teacher. Accessible for all levels. No registration needed; mats provided.",
            "venue": "Yoga Room, 3rd Floor, New Gymkhana Building (Opp. Hostel 11)",
            "organisingBody": "Yogastha, IIT Bombay",
            "contact": "+91 9619000065"
        }
    },
    {
        "title": "Resume-Building Session with Industry Leader",
        "start": "2025-08-10T11:00:00",
        "end": "2025-08-10T11:00:00",
        "extendedProps": {
            "description": "A resume-building session specifically for PG (masters or PhD) final year students preparing for placements. The session will be led by Industry Leader Danny Savla (SVP - Technology, Genesys International) and will focus on how to craft a resume that stands out. Attendees will earn 1 incentive point for full attendance.",
            "venue": "LA 201",
            "organisingBody": "Post Graduate Council for Academics and Mentoring Programmes (PG-CAMP)",
            "contact": "gsecaapg@iitb.ac.in"
        }
    },
    {
        "title": "River Rafting Kolad",
        "start": "2025-08-15TNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "Adventure Club invites you to be part of our first-ever River Rafting trip at Kolad on 15th August 2025. Experience the thrill of riding the rapids of the Kundalika River, surrounded by lush monsoon landscapes. Whether you’re a first-timer or an adventure pro, this adrenaline-packed activity is perfect for all skill levels.",
            "venue": "Kolad, Kundalika River",
            "organisingBody": "Adventure Club, Institute Sports Council, IIT Bombay",
            "contact": "Mohit Yadav, Manager- Adventure Club: +91 8233470289; Rajwardhan Toraskar, General Secretary, Sports Affairs, IIT Bombay: +91 9619000065"
        }
    }
]