[
    {
        "title": "Central Library Orientation 2025",
        "start": "2025-08-04T10:00:00",
        "end": "2025-08-08T10:00:00",
        "extendedProps": {
            "description": "Detailed Library Orientation Program for new entrants and senior students interested in learning more about library resources and services.  Covers access to digital resources, research support, and library events.",
            "venue": "Conference Hall, 2nd Floor, Central Library",
            "organisingBody": "Central Library",
            "contact": "+91-22-2576-8936 / 8926"
        }
    },
    {
        "title": "Roshni: Bringing the Light of Rural Artistry",
        "start": "2025-08-04T11:00:00",
        "end": "2025-08-05T11:00:00",
        "extendedProps": {
            "description": "An initiative by the Group for Rural Activities (GRA) to connect students with rural Indian artisans.  Features online ordering and an offline exhibition of handcrafted items like Bamboo Rakhis, Key Chains, Notebooks, Side Bags, Jewellery, etc.  Proceeds support rural artisans and promote sustainable crafts.",
            "venue": "Hostels 10, 11, and 15 mess areas (7:30 PM to 9:30 PM), Staff Canteen (11:00 AM to 5:00 PM)",
            "organisingBody": "Group for Rural Activities (GRA), IIT Bombay",
            "contact": "9831876729 || 7850869073"
        }
    },
    {
        "title": "ShARE IITB Orientation",
        "start": "2025-08-03T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Orientation for ShARE IITB, a student-run leadership and consulting organization.  Includes information about their recruitment process, a guest speaker (Jahnvi Nandwani), fun activities, and prizes. Winners of ShARE's Business Challenge will be announced.",
            "venue": "LT-PCSA",
            "organisingBody": "ShARE IITB, UGAC",
            "contact": "https://www.shareiitb.org/"
        }
    },
    {
        "title": "Student Vaccination Drive",
        "start": "2025-08-03T09:15:00",
        "end": "2025-08-03T09:15:00",
        "extendedProps": {
            "description": "Vaccination drive for students.  MMR, Chicken Pox, Typhoid, and Hepatitis A vaccines are offered. Paid basis (Administration Charges + Vaccine Charges). Online payment only.  Verification of vaccine records for new students.",
            "venue": "Hospital new OPD wing",
            "organisingBody": "Bha.Prau.San. Hospital, CMO(SAG)",
            "contact": "Dr. Arvind Meshram"
        }
    },
    {
        "title": "Inter IIT Tech Meet 14.0",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The largest annual tech showdown among all IITs—featuring mind-bending competitions, cutting-edge innovation, entrepreneurial brilliance, and tech-for-impact challenges.",
            "venue": null,
            "organisingBody": "Institute Technical Council, IIT Bombay",
            "contact": "+91 91460 50850"
        }
    },
    {
        "title": "Free Webinar for students looking to pursue higher studies in Germany",
        "start": "2025-08-06T16:00:00",
        "end": "NoneT16:00:00",
        "extendedProps": {
            "description": "Step-by-step admission process through the new Consular Service Portal\nOverview of preparatory programs for international students\nInformation on visa procedures, scholarships, and tuition\nOpportunity to ask questions live to our team",
            "venue": "Online",
            "organisingBody": "German Consulate General, Mumbai & Indian Institute of Technology (IIT) Bombay",
            "contact": "Rebecca Jadin, +91-22-21593069, http://www.ir.iitb.ac.in"
        }
    },
    {
        "title": "iGEM IIT Bombay Education Outreach Tech Team Recruitment",
        "start": "NoneTNone",
        "end": "2025-08-12TNone",
        "extendedProps": {
            "description": "Recruitment for sophomores (B.Tech, B.Des, and B.S. students) for two key roles within the Education Outreach Subsystem: Visual Communicator and Website UI/UX Designer.  No prior experience needed.",
            "venue": null,
            "organisingBody": "iGEM IIT Bombay",
            "contact": "+91 93405 94582 & +91 70233 89911"
        }
    },
    {
        "title": "LRWC Support Courses for Autumn Semester 2025",
        "start": "2025-08-04T13:00:00",
        "end": "2025-08-08T13:00:00",
        "extendedProps": {
            "description": "Language support courses offered by the Language Resource and Writing Centre (LRWC) including Academic Speaking for Researchers, Foundations of Academic Speaking, and Essentials for Academic Writing.  Personalized consultations also available.",
            "venue": "LRWC Desk (24x7 Reading Hall, Central Library)",
            "organisingBody": "Language Resource and Writing Centre (LRWC)",
            "contact": "lrwcinstructor@iitb.ac.in"
        }
    },
    {
        "title": "Condolence Meeting for Mr Rohit Sinha",
        "start": "2025-08-04T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A condolence meeting for Mr Rohit Sinha, who passed away recently, is scheduled.",
            "venue": "LA 001",
            "organisingBody": "Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay",
            "contact": "Dr. Ajay Singh Panwar, Head, Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay, Phone: +91-22-2576 7600"
        }
    },
    {
        "title": "e-Yantra Robotics Competition (eYRC 2025-26)",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "e-Yantra Robotics Competition (eYRC 2025-26) is IIT Bombay's signature Project-Based Learning (PBL) robotics competition, now open for registrations. It invites participants to showcase talents in robotics and engineering, involving technologies such as Robot Operating System (ROS), Drone Control, Image Processing, 3D Designing, Embedded Systems, Control Systems Design, Field Programmable Gate Arrays (FPGAs) Programming, and Reinforcement Learning.",
            "venue": null,
            "organisingBody": "e-Yantra, IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Basic First Aid and CPR Training",
        "start": "2025-08-09T11:00:00",
        "end": "2025-08-09T11:00:00",
        "extendedProps": {
            "description": "Join us for a hands-on Basic First Aid and CPR Training session organized by the Fire & Safety Section, Office of Dean (IPS). This is a great opportunity to equip yourself with life-saving skills and be prepared to act in emergencies. The first 50 registrants will secure their spot on a first-come, first-served basis. This Raksha Bandhan, let us extend the bond of protection beyond tradition, by learning CPR and being there for someone when it matters most.",
            "venue": null,
            "organisingBody": "Fire & Safety Section, Office of Dean (IPS), Indian Institute of Technology Bombay",
            "contact": "Amit Kumar, Technical Officer, Fire and Safety Section, Office of Dean (IPS), IIT Bombay, Telephone: +91-22 21593050"
        }
    },
    {
        "title": "Independence Day Programme 2025",
        "start": "2025-08-15TNone",
        "end": "2025-08-15TNone",
        "extendedProps": {
            "description": "Official announcement for the Independence Day Programme and celebrations, inviting all to attend in person or via live webcast.",
            "venue": null,
            "organisingBody": "IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Samadhan 2025 – National Social Innovation Challenge",
        "start": "2025-08-18TNone",
        "end": "2025-11-08TNone",
        "extendedProps": {
            "description": "A national-level social innovation challenge organized by UPAY NGO, in collaboration with GRA, IIT Bombay. Participants form teams of 2-4 students to propose and refine solutions for real-world issues faced by street children across India, with mentorship from industry experts. Top teams will pitch at a national stage, with opportunities for cash prizes and potential implementation. Not open to UG Freshers (2025 UG entrants).",
            "venue": null,
            "organisingBody": "UPAY NGO, GRA, IIT Bombay",
            "contact": "Archishman Ray, Tanushree (Overall Coordinators, GRA, IIT Bombay), Phone: 9831876729, 7850869073"
        }
    },
    {
        "title": "Shashwat Panda Memorial Lecture",
        "start": "2025-08-08T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A lecture by Ms. Rama Bijapurkar titled 'Understanding India's Household Consumption Story'.",
            "venue": "PC Saxena Auditorium",
            "organisingBody": "Office of Dean ACR",
            "contact": null
        }
    },
    {
        "title": "Fine Arts NOCS Trials",
        "start": "2025-08-06T18:30:00",
        "end": "2025-08-06T18:30:00",
        "extendedProps": {
            "description": "Important update regarding the Fine Arts NOCS trials previously announced. The trials will now be held only on 6th August 2025 from 6:30 PM to 8:00 PM at LC 301, Lecture Complex. Please note that there will be no trials on 7th August as mentioned earlier.",
            "venue": "LC 301, Lecture Complex",
            "organisingBody": "Institute Cultural Council",
            "contact": "Omprakash Chaturvedi (NSO Cultural Coordinator) - 7972643853"
        }
    },
    {
        "title": "QuantFest'25",
        "start": "2025-08-24T10:00:00",
        "end": "2025-08-24T13:00:00",
        "extendedProps": {
            "description": "QuantFest '25 is an analytical thinking and probability-based challenge competition inspired by top quant firms. It includes Prelims on August 24, 2025, focusing on Probability, Puzzles, and Logical Reasoning, and Regionals on September 27, 2025, a simulation-style round for top performers. Registration deadline is August 7, 2025.",
            "venue": "On-campus (venue TBA)",
            "organisingBody": "Technical Affairs, IIT Bombay",
            "contact": "Siva Madhav Chinta: +91 8639147440, Prabhat Dubey: +91 9076373141, Shahu Patil: +91 91460 50850"
        }
    },
    {
        "title": "BioFront Symposium 2k25: Unveiling New Frontiers of Biotech",
        "start": "2025-08-09TNone",
        "end": "2025-08-10TNone",
        "extendedProps": {
            "description": "A pan-India online symposium hosted by BioX, IIT Bombay, exploring the convergence of biotechnology with engineering, AI, data science, nanotech, and material sciences. Features keynote talks by leading researchers and industry experts, interactive sessions, and thematic panel discussions on emerging domains like Neuroscience, Health-tech, Bioinformatics, and Nano-tech.",
            "venue": "Online (MS Teams)",
            "organisingBody": "BioX, IIT Bombay, in collaboration with Biotech Club – IIT Madras, Science Club – IISER Pune, BioNexus – SRMIST, and Genesys – NIT Rourkela",
            "contact": "Gaurish Khodke, BioX Manager 25-26 (+91 9766206523); Shahu Patil, General Secretary Technical Affairs 25-26, IIT Bombay (+91 91460 50850)"
        }
    },
    {
        "title": "Har Ghar Tiranga Campaign 2025",
        "start": "2025-08-13TNone",
        "end": "2025-08-15TNone",
        "extendedProps": {
            "description": "Independence Day 2025 'Har Ghar Tiranga' campaign encouraging campus residents to hoist flags and post selfies on harghartiranga.com (Aug 13-15, 2025). A selfie booth will be at the Institute Arch on Aug 15, 2025. A national online quiz on MyGov (quiz.mygov.in) offers certificates and cash prizes.",
            "venue": "IIT Bombay Campus (Institute Arch for selfie booth) and Online platforms",
            "organisingBody": "Indian Institute of Technology Bombay",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, IIT Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "Vartalap - Let's Talk: Balancing Books and Being",
        "start": "2025-08-08T19:00:00",
        "end": "2025-08-08T19:00:00",
        "extendedProps": {
            "description": "This month's Vartalap session, titled 'BALANCING BOOKS AND BEING: Growing Through Change in Academic Life', is a reflective session dedicated to helping students navigate transitions, support mental wellness, and find steadiness in academic life. Part of a monthly expert-led series on mental health and wellness, Vartalap provides a space to pause, listen, and explore themes like well-being, relationships, and personal growth through honest conversation, not a lecture. It is open to all students, whether new or established.",
            "venue": "LC-102, Lecture Hall Complex - 1",
            "organisingBody": "Team SWC, IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Beginner and Intermediate Swimming Camp",
        "start": "2024-08-08T07:15:00",
        "end": "2024-08-18T07:15:00",
        "extendedProps": {
            "description": "A series of Aquatics Camps by the Institute Sports Council offering swimming lessons from a respected coach. Camps include Intermediate (7:15 AM - 8:00 AM, Basic Freestyle required), Girls Beginners (5:30 PM - 6:15 PM), and Boys Beginner (7:00 PM - 7:45 PM), each with 30 seats and a fee of Rs 100/-.",
            "venue": null,
            "organisingBody": "Institute Sports Council",
            "contact": "Meet Vanja, 9323587701"
        }
    },
    {
        "title": "Careers in Astronomy & Astrophysics",
        "start": "NoneT19:30:00",
        "end": "NoneT19:30:00",
        "extendedProps": {
            "description": "Krittika, the Astronomy Club of IIT Bombay, invites you to a Q&A panel discussion for all those curious about turning their passion for astronomy and astrophysics into a career. Learn about the diverse paths the field offers, hear firsthand experiences from those who’ve pursued it and get your questions answered by professionals in the domain.",
            "venue": "Seminar Hall, 2nd Floor, Physics Dept.",
            "organisingBody": "Krittika, the Astronomy Club of IIT Bombay",
            "contact": "Yash Palwe (99709 73860), Anvit Khade (99877 99311), Shahu Patil (+91 91460 50850)"
        }
    },
    {
        "title": "Institute Technical Summer Projects (ITSP) Exhibition 2025",
        "start": "2025-08-09T14:00:00",
        "end": "2025-08-09T14:00:00",
        "extendedProps": {
            "description": "Invitation to one of the coolest events kicking off the tech scene at IIT Bombay, showcasing amazing student projects from AI and robotics to drones and design, built as part of the ITSP program. Attendees can explore innovative ideas, chat with project teams, learn how things were built from scratch, and spark ideas for future projects.",
            "venue": "Convocation Hall Foyer",
            "organisingBody": "Institute Technical Council",
            "contact": "Gaurish (9766206523), Aniket (6205741275), Sumedh (7588055255), Veeraditya (9449007525), Shahu Patil (+91 91460 50850)"
        }
    },
    {
        "title": "Institute Technical Council (ITC) UG & PG Freshers Orientation",
        "start": "2025-08-09T14:00:00",
        "end": "NoneT14:00:00",
        "extendedProps": {
            "description": "Welcome to IIT Bombay! The Institute Technical Council (ITC) invites UG & PG Freshers to their orientation, serving as the first step into IITB's vibrant tech world. This event marks the beginning of your journey with 9 diverse Technical Clubs (robotics, coding, astronomy, energy science, mathematics, Biotech, etc.). It's a gateway to discover where you belong, offering a firsthand look at IITB's tech scene, interaction with club members, and insights into involvement opportunities, hands-on learning, competitions, and projects designed to spark creativity and technical growth. Attendees can also expect cool freebies by arriving early.",
            "venue": "Convocation Hall",
            "organisingBody": "Institute Technical Council (ITC), IIT Bombay",
            "contact": "Shahu Patil, General Secretary Technical Affairs 25-26, IIT Bombay, +91 91460 50850"
        }
    },
    {
        "title": "Independence Day 2025 Celebrations",
        "start": "2025-08-15T09:00:00",
        "end": "2025-08-15T09:00:00",
        "extendedProps": {
            "description": "Announcement of Mr. Rajeev M. Pandia, a distinguished alumnus, as the Chief Guest for Independence Day 2025 celebrations at IIT Bombay. The email highlights his extensive career in the chemical industry and significant contributions.",
            "venue": "Institute Arch",
            "organisingBody": "Indian Institute of Technology Bombay (IIT Bombay)",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "National Librarian's Day Celebrations",
        "start": "2025-08-12T11:00:00",
        "end": "NoneT11:00:00",
        "extendedProps": {
            "description": "Invitation to celebrate National Librarian's Day, featuring a special talk by Dr. Jagdish Arora on 'Beyond the Books and Journals: Role of AI in the Future of Academic Libraries'.",
            "venue": "Conference Hall, Central Library, IIT Bombay",
            "organisingBody": "Central Library, IIT Bombay",
            "contact": "Chief Library Officer, Central Library, IIT Bombay, Powai, Mumbai - 400 076, Email: office.library@iitb.ac.in, Phone: 022 2576 8921"
        }
    },
    {
        "title": "Inter IIT Pre Camp Cricket Trials",
        "start": "2025-08-24T10:00:00",
        "end": "2025-08-24T13:00:00",
        "extendedProps": {
            "description": "The Institute Sports Council announces Inter IIT Pre Camp PG and UG cricket trials. PG trials are on Sunday, August 17th, and UG trials on Sunday, August 24th, both commencing promptly at 10 am at the Indoor Cricket Courts. Participants must bring appropriate sports shoes and batters require abdomen support. Registration is mandatory via the provided Google Form.",
            "venue": "Indoor Cricket Courts",
            "organisingBody": "Institute Sports Council",
            "contact": "Pradyumna Gugulothu (Institute Cricket Secretary): 7103954490"
        }
    },
    {
        "title": "Shashwat Panda Memorial Lecture",
        "start": "2025-08-08T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Ms. Rama Bijapurkar will deliver a lecture on Understanding India’s Household Consumption Story.",
            "venue": "PC Saxena Auditorium",
            "organisingBody": "Office of Dean ACR",
            "contact": null
        }
    },
    {
        "title": "Careers in Astronomy & Astrophysics",
        "start": "2025-08-07T19:30:00",
        "end": "2025-08-07T19:30:00",
        "extendedProps": {
            "description": "Krittika, the Astronomy Club of IIT Bombay, invites you to a Q&A panel discussion for all those curious about turning their passion for astronomy and astrophysics into a career. Learn about the diverse paths the field offers, hear firsthand experiences from those who’ve pursued it and get your questions answered by professionals in the domain. Meet Our Panelists: - Gaurav Waratkar – Postdoctoral researcher at Caltech, specializing in high-energy astrophysics, astronomical instrumentation, and gravitational wave transients. - Praveer Tiwari – Postdoctoral researcher at IIT Bombay, with expertise in supermassive black holes, gravitational waves, and nuclear astrophysics. - Yogesh Wagh – PhD at Liverpool John Moores University (LJMU), working on near-Earth asteroid detection, gamma-ray burst (GRB) afterglows, and scheduling algorithms for gravitational wave follow-ups. - Sameer Patil – Phd at STARLAB, he is a technologist turned Astrophysicist with 25 years of software experience at firms like Morgan Stanley, MCSI and Google, he is now doing research in 21 cm cosmology, GRBs and use of AI/ML techniques in Astrophysics.",
            "venue": "Seminar Hall, 2nd Floor, Physics Dept.",
            "organisingBody": "Krittika, the Astronomy Club of IIT Bombay",
            "contact": "Yash Palwe: 99709 73860, Anvit Khade: 99877 99311"
        }
    },
    {
        "title": "NSS Department Orientation for NOCS students",
        "start": "NoneT09:30:00",
        "end": "NoneT09:30:00",
        "extendedProps": {
            "description": "Greetings from NSS IIT Bombay! Are you ready to step into a journey that blends purpose with passion? To introduce you to the joy of volunteering and making real-world impact, NSS IIT Bombay is conducting a Department Orientation. This session will walk you through our wide range of initiatives, show you how each department contributes to meaningful change, and help you find your place in this movement. Mandatory for all freshers who selected NSS as NOCS 1st or 2nd preference. Others who are curious and passionate are warmly welcome too! Exciting freebies await you… But the real reward? Discovering how you can help change lives — starting with your own. Join the WhatsApp group for regular updates about the same - https://chat.whatsapp.com/GUajfMHNYliFHMNVVOOsAK",
            "venue": "LH102",
            "organisingBody": "NSS IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "XLR8 Orientation",
        "start": "2025-08-09T16:30:00",
        "end": "NoneT16:30:00",
        "extendedProps": {
            "description": "Join the Electronics & Robotics Club (ERC) for the XLR8 Orientation, IIT Bombay’s largest tech event. This session offers a firsthand look at robotics and electronics, featuring a dynamic obstacle course challenge and a hands-on workshop to build your own WiFi-controlled bot from scratch. Expect exciting surprises and a memorable session, perfect for beginners and curious minds.",
            "venue": "LA 002",
            "organisingBody": "Electronics and Robotics Club",
            "contact": "Saravan Kumar: +918247227509, Srivathsa Thotakura: +919137164841"
        }
    },
    {
        "title": "नशा मुक्त भारत पखवाड़ा (Drug-Free India Fortnight)",
        "start": "2025-08-15TNone",
        "end": "2025-08-16TNone",
        "extendedProps": {
            "description": "The Narcotics Control Bureau (NCB) has organised a nation-wide campaign, 'नशा मुक्त भारत पखवाड़ा', during August 15-16, 2025, to promote a drug-free India. All campus residents are requested to participate by taking the e-pledge against drug abuse via the provided link: https://nmba.dosje.gov.in/content/take-a-pledge. Download your pledge certificate upon completion.",
            "venue": "Online",
            "organisingBody": "Narcotics Control Bureau (NCB)",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, IIT Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "IRCC's TechConnect Logo Design Competition",
        "start": "2025-07-29TNone",
        "end": "2025-08-18TNone",
        "extendedProps": {
            "description": "A logo design competition for the upcoming IIT Bombay- IRCC's TechConnect. Open to students, staff, and faculty to contribute innovative designs for TechConnect's identity. Details and submission via provided links (Flyer, Guidelines, Registration Form).",
            "venue": null,
            "organisingBody": "IRCC, IIT Bombay (Office of Dean R&D)",
            "contact": "dean.rnd.office@iitb.ac.in"
        }
    },
    {
        "title": "HPCL-IITB Energy Transition Challenge",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The HPCL-IITB Energy Transition Challenge aims to engage students, startups, researchers, and refinery professionals in ideating practical, scalable, and disruptive solutions for decarbonizing refinery operations and processes, under the theme 'Energy Transition in Refineries through Innovation'. Participants can win cash prizes up to ₹60,000.",
            "venue": null,
            "organisingBody": "Hindustan Petroleum Corporation Limited (HPCL), Research Hub for Green Energy and Sustainability (GESH IITB), Centre of Excellence in Oil, Gas, and Energy (CoE-OGE IITB)",
            "contact": "Ms. Jaya K, Senior Associate - Entrepreneurship, GESH IITB, 30006497@iitb.ac.in"
        }
    },
    {
        "title": "Institute Technical Council (ITC) UG & PG Freshers Orientation",
        "start": "2025-08-09T14:00:00",
        "end": "2025-08-09T14:00:00",
        "extendedProps": {
            "description": "Welcome to IIT Bombay! This orientation is your first step into the vibrant world of tech at IITB, marking the beginning of your journey with 9 diverse Technical Clubs under ITC (covering fields like robotics, coding, astronomy, energy science, mathematics, Biotech and more). This is your chance to discover where you belong now. Get a firsthand look at how the tech scene at IITB works, interact with club members, and discover how to get involved. We’ll also walk you through opportunities for hands-on learning, competitions, and projects — all designed to spark your creativity and technical growth.",
            "venue": "Convocation Hall",
            "organisingBody": "Institute Technical Council (ITC), IIT Bombay",
            "contact": "Shahu Patil, General Secretary Technical Affairs, IIT Bombay; +91 91460 50850; gsectech@iitb.ac.in"
        }
    },
    {
        "title": "Extended Services of SWC: One-on-one Emotional Support",
        "start": "2025-08-09T10:00:00",
        "end": "2025-08-10T10:00:00",
        "extendedProps": {
            "description": "Counsellor will be available for one-on-one emotional support at the SWC Office. Students can walk-in or contact via phone/email during specified hours. The Student Wellness Centre encourages students to utilize available support for emotional well-being. Emergency contact information and an online counselling platform are also provided.",
            "venue": "SWC Office (Nandan Nilekani Main Building, 3rd floor)",
            "organisingBody": "Student Wellness Centre, IIT Bombay",
            "contact": "wellness@iitb.ac.in"
        }
    },
    {
        "title": "Resume-Building Session with Industry Leader",
        "start": "2025-08-10T11:00:00",
        "end": "2025-08-10T11:00:00",
        "extendedProps": {
            "description": "The resume-building session for PG (masters or PhD) final year students sitting for placements will teach how to craft a resume that stands out. PG students will receive 1 incentive point for attending from 10:50 AM till the end. Open to all final year PG students.",
            "venue": "LA 201",
            "organisingBody": "PG-CAMP team",
            "contact": "Priyanka Talwar, General Secretary Academic Affairs (PG), Post Graduate Council for Academics and Mentoring Programmes, Indian Institute of Technology Bombay, Powai, Mumbai - 400076. Email: gsecaapg@iitb.ac.in, Contact: +91 8637313704"
        }
    },
    {
        "title": "Iyengar Yoga | Weekly Morning Sessions",
        "start": "NoneT06:15:00",
        "end": "NoneT06:15:00",
        "extendedProps": {
            "description": "Yogastha invites you to weekly morning Iyengar Yoga sessions focusing on precision, alignment, and strength, guided by an experienced teacher. Accessible for all levels. No registration needed; mats provided.",
            "venue": "Yoga Room, 3rd Floor, New Gymkhana Building (Opp. Hostel 11)",
            "organisingBody": "Yogastha, IIT Bombay",
            "contact": "+91 9619000065"
        }
    },
    {
        "title": "Resume-Building Session with Industry Leader",
        "start": "2025-08-10T11:00:00",
        "end": "2025-08-10T11:00:00",
        "extendedProps": {
            "description": "A resume-building session specifically for PG (masters or PhD) final year students preparing for placements. The session will be led by Industry Leader Danny Savla (SVP - Technology, Genesys International) and will focus on how to craft a resume that stands out. Attendees will earn 1 incentive point for full attendance.",
            "venue": "LA 201",
            "organisingBody": "Post Graduate Council for Academics and Mentoring Programmes (PG-CAMP)",
            "contact": "gsecaapg@iitb.ac.in"
        }
    },
    {
        "title": "River Rafting Kolad",
        "start": "2025-08-15TNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "Adventure Club invites you to be part of our first-ever River Rafting trip at Kolad on 15th August 2025. Experience the thrill of riding the rapids of the Kundalika River, surrounded by lush monsoon landscapes. Whether you’re a first-timer or an adventure pro, this adrenaline-packed activity is perfect for all skill levels.",
            "venue": "Kolad, Kundalika River",
            "organisingBody": "Adventure Club, Institute Sports Council, IIT Bombay",
            "contact": "Mohit Yadav, Manager- Adventure Club: +91 8233470289; Rajwardhan Toraskar, General Secretary, Sports Affairs, IIT Bombay: +91 9619000065"
        }
    },
    {
        "title": "XLR8",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "Your first and biggest event with the Electronics & Robotics Club! No prerequisites required – no coding, no soldering, no prior experience with microcontrollers. Bring your curiosity and enthusiasm to build your very first project at IIT Bombay.",
            "venue": "IIT Bombay",
            "organisingBody": "Electronics & Robotics Club",
            "contact": "Saravan Kumar: +918247227509, Srivathsa Thotakura: +919137164841. Website: https://erc.tech-iitb.org/, Instagram: https://www.instagram.com/erc.iitb. General Secretary Technical Affairs: Shahu Patil (+91 91460 50850)."
        }
    },
    {
        "title": "TechConnect 2025 – IIT Bombay’s Flagship R&D Showcase",
        "start": "2025-12-22TNone",
        "end": "2025-12-24TNone",
        "extendedProps": {
            "description": "TechConnect 2025 is IIT Bombay’s flagship Research & Development showcase, providing a platform for faculty, researchers, students, industry professionals, and policymakers to engage in dialogue, explore cutting-edge research, and foster collaborations. It includes a TechConnect Exhibition, TechConnect Symposium, and ResCon – The Undergraduate Research Conclave.",
            "venue": "IIT Bombay",
            "organisingBody": "Office of Dean R&D, IIT Bombay",
            "contact": "tc2025@ircc.iitb.ac.in"
        }
    },
    {
        "title": "AtomQuest 2025: Atomberg's Flagship Engineering Challenge",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "AtomQuest 2025 is Atomberg's flagship innovation-driven hackathon where top engineering talent from across India builds real-world solutions. It offers ₹2,00,000 in cash prizes, exclusive mentorship from Atomberg's product & R&D leaders, and direct internship and full-time opportunities. All UG, PG, and PhD engineering students from any branch and year can apply in teams of 3-5 members. Cross-discipline and cross-college teams are encouraged.",
            "venue": null,
            "organisingBody": "Atomberg Technologies",
            "contact": "Rakshita Singh (Campus SPOC): +91 7007702371"
        }
    },
    {
        "title": "Team ChemEca IIT Bombay Sophomore Orientation",
        "start": "2023-08-13T21:00:00",
        "end": "2023-08-13T21:00:00",
        "extendedProps": {
            "description": "An open session to get to know Team ChemEca IIT Bombay, their work, and the opportunities they offer.",
            "venue": "LC 102",
            "organisingBody": "Team ChemEca IIT Bombay",
            "contact": "Param: +91 9428989809, Ojas: +91 7058448506, Jayant: +91 9518340057, Renudhruva: +91 636615695"
        }
    },
    {
        "title": "National Librarian's Day Celebrations",
        "start": "2025-08-12T11:00:00",
        "end": "2025-08-12T11:00:00",
        "extendedProps": {
            "description": "Celebration of National Librarian's Day, featuring a special talk by Dr. Jagdish Arora on 'Beyond the Books and Journals: Role of AI in the Future of Academic Libraries'.",
            "venue": "Conference Hall, Central Library, IIT Bombay",
            "organisingBody": "Central Library, IIT Bombay",
            "contact": "Chief Library Officer, Central Library, IIT Bombay. Email: office.library@iitb.ac.in, Phone: 022 2576 8921."
        }
    },
    {
        "title": "Sophieprod Orientation",
        "start": "2024-08-12T19:00:00",
        "end": "NoneT19:00:00",
        "extendedProps": {
            "description": "Fourthwall – the Dramatics Club of IIT Bombay invites you to be part of the Sophieprod Orientation. This is a fantastic opportunity to learn more about the club’s activities and get involved in the world of acting and theatre. If you want to explore drama, acting, writing, or direction for the first time, Sophieprod is your chance to experience it all. Try your hand at acting, writing, direction, backstage work, or production design, whether you’re a first-timer or already experienced. Hear experiences from seniors in the club who are ready to mentor you. Enjoy freebies and refreshments. Don’t miss out on this chance to be part of a dynamic community that shares your passion for theatre. We welcome everyone who’s eager to explore theatre and make this year’s Sophieprod truly memorable.",
            "venue": "Theatre Room, Old SAC",
            "organisingBody": "Fourthwall – the Dramatics Club of IIT Bombay",
            "contact": "Omprakash Chaturvedi, Institute Dramatics Secretary, 7972643853"
        }
    },
    {
        "title": "Exchange 101 Session",
        "start": "2025-08-13TNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": null,
            "venue": null,
            "organisingBody": null,
            "contact": null
        }
    },
    {
        "title": "A session on the NI product LabVIEW",
        "start": "2025-08-13T14:00:00",
        "end": "2025-08-13T14:00:00",
        "extendedProps": {
            "description": "A session for users of LabVIEW software from NI, focusing on the NI platform, PXIe systems, hardware interaction using Instrument Studio and LabVIEW, setup and testing of Device Under Test (DUT), test automation with TestStand, and information on procuring and servicing NI products with support from BlauPlug. The session includes an overview of National Instruments and its technology platforms.",
            "venue": "LH 301, Indian Institute of Technology, Bombay, 400076, India",
            "organisingBody": "Computer Centre, Indian Institute of Technology Bombay, in collaboration with National Instruments and BlauPlug",
            "contact": "Jyoti Prasad Maharana (Ph.D, IIT Bombay), Computer Centre. Telephone: Office Desk: +91-022-25767753, Computer Centre Office: +91-022-2576 7751, Cell: +91-9920278063"
        }
    },
    {
        "title": "IITB Staff Excellence Awards Function",
        "start": "2025-08-15T10:15:00",
        "end": "NoneT10:15:00",
        "extendedProps": {
            "description": "The IIT Bombay Staff Excellence Awards will be conferred to the awardees. You are cordially invited to felicitate the first batch of awardees and recognize the consistent contributions of non-teaching officers and staff.",
            "venue": "B Nag Auditorium, VMCC Ground Floor",
            "organisingBody": "Indian Institute of Technology Bombay",
            "contact": "Nand Kishore, dean.aa@iitb.ac.in, Phone: 022-2576-7157 (Office), 9820605370 (Mobile)"
        }
    },
    {
        "title": "ShARE IITB Orientation",
        "start": "2025-08-13T20:30:00",
        "end": "2025-08-13T20:30:00",
        "extendedProps": {
            "description": "An orientation session by ShARE IITB, a student-run leadership and consulting organization. This event is for 2nd and 3rd-year undergraduate students and postgraduate students, introducing ShARE, detailing its recruitment process, and announcing winners of ShARE's Business Challenge who will get direct interview opportunities. The session includes engaging activities, fun games, prizes, freebies, and features a special guest speaker, Disha Lalwani (IITB alumna and Analyst at DBS Bank), who will share career insights and her experience with ShARE.",
            "venue": "LC 201",
            "organisingBody": "ShARE IITB, UGAC",
            "contact": "gsecaaug@iitb.ac.in"
        }
    },
    {
        "title": "A session on the NI product LabVIEW",
        "start": "2025-08-13T14:00:00",
        "end": "2025-08-13T14:00:00",
        "extendedProps": {
            "description": "A session for users of LabVIEW software on the NI platform. The agenda includes: Overview of National Instruments and its technology platforms, PXIe Platform exploration, Hands-on Hardware Interaction (measurements with Instrument Studio, LabVIEW interaction with PXIe hardware), Setup and Testing of Device Under Test (DUT) using PXIe instruments, Automating test sequences with TestStand, and Services offered by BlauPlug as an Alliance Partner of NI (procurement, maintenance, service support).",
            "venue": "LH 301",
            "organisingBody": "Indian Institute of Technology, Bombay (IITB) - Computer Centre",
            "contact": "Dr Jyoti Prasad Maharana (jyoti@iitb.ac.in)"
        }
    },
    {
        "title": "Joy of Discovery in the Modern Era : Some Reflections and Directions",
        "start": "2025-08-13T17:15:00",
        "end": "2025-08-13T17:15:00",
        "extendedProps": {
            "description": "About the Speaker: Prof. B. Ananthanarayan is a professor and former chair of the center for High Energy Physics at the Indian Institute of Science. He obtained his B.Tech. in Chemical Engineering from IIT Madras in 1985 (as part of the last five year batch) and completed his M.S. and Ph.D. from the University of Delaware, USA, 1988 and 1991, respectively. After post-doctoral work at the Physical Research Laboratory (PRL) in Ahmedabad, University of Lausanne and Bern, he joined IISc in 1996 and has been there ever since. His research spans several areas of elementary particle physics and field theory. Additionally, he has been involved in editorial work for Springer for over a decade and a half and is well known for his outreach efforts through writings and popular talks. BA was Homi Bhabha Fellow, 2009-2011, was awarded the Rustom Choksi Award for Excellence in Science, 2014 by IISc, held the MSIL Chair of the Division of Physical and Mathematical Sciences, IISc. BA was Chair of CHEP for a record period of over 9 years and 7 months. He is presently on the Governing Council of the IUAC, Delhi, and serves on the India-CERN Task Force of the DAE and DST, and has been recently inducted into the advisory committee for the dual degree of IIIT Hyderabad. Speaker's webpage: https://chep.iisc.ac.in/Personnel/pages/anant/index.html Abstract: In this talk, we shall discuss the project of knowledge production as a profession and as a career, and the calling of a professional. We will present general arguments by looking into some contemporary examples drawn from different disciplines. We will described at a popular level recent discoveries such as gravitational waves which unites physics at the largest and smallest scales and the discovery of the Higgs boson which required a heroic man made machine. We will appeal to other examples from mathematics, computer science, biology, climate science, to name a few to motivate the challenges of the present era. We will also look into the issues of the psychology of creativity. Of importance are also questions of science and engineering in India as a developing country and that of representation of women among others. We will also touch on important issues of the role of the individual, of working in teams, and of communication. Stated differently this talk aims to provide a motivational framework and spells out the gestalt needed for a young person to enter the daunting field of research and discovery and to be a part of the great discoveries that lie ahead. The talk is aimed at a very broad audience and is accessible even to class XI and XII students, and for students across all B. Tech, M.Sc, Ph.D. students in all branches of sciences, and also to teachers and researchers in all areas of science. The speaker is well suited for this as someone with experience in both engineering and science. We wish to leave a lot of time for discussion at the end of the talk and encourage participation from all, young and not so young.",
            "venue": "Room No. 22, 2nd floor, VMCC, IIT Bombay",
            "organisingBody": "Indian Institute of Technology Bombay",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, Indian Institute of Technology Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "Independence Day Programme 2025",
        "start": "2025-08-15T08:55:00",
        "end": "2025-08-15T08:55:00",
        "extendedProps": {
            "description": "Revised schedule for the Independence Day Programme 2025: 08.55 am: The Director arrives at the venue. 08.59 am: The Director proceeds to the dais. 09.00 am: The Director hoists the National Flag, and the National Anthem follows. 09.05 am: Address by the Director. 09.10 am: Address by the Chief Guest, Shri Rajiv M. Pandia, Distinguished alumnus. 09.15 am: Felicitation of the two longest serving employees by the Director & the Chief guest. 09.20 am: Cultural Programme. Followed by Staff Excellence award function at B Nag Auditorium, VMCC. All are invited to attend the above events. Those who are unable to attend the Independence Day celebrations can participate virtually by watching the live web-casting available at the link below: https://www.youtube.com/c/IITBombayOfficialChannel",
            "venue": null,
            "organisingBody": "IIT Bombay",
            "contact": "Vasumathi S, DR (F&SS)"
        }
    },
    {
        "title": "Tiranga Yatra - Independence Day 2025",
        "start": "2025-08-15T10:30:00",
        "end": "2025-08-15T10:30:00",
        "extendedProps": {
            "description": "The annual Tiranga Yatra, a spirited procession across the IIT Bombay campus, where participants carry a 1000 ft Tricolour to celebrate India's Independence Day, shared heritage, unity, and national pride.",
            "venue": "Main Archway (near Main Building) to NCC Area, IIT Bombay Campus",
            "organisingBody": "NCC IIT Bombay",
            "contact": "Falguni Banerjee Naha, Public Relations Officer, IIT Bombay, Tel: (+91-22) 25767026-27"
        }
    },
    {
        "title": "Gram Bhraman: A Rural Exploration Camp & Field Visit to Mamnoli",
        "start": "2025-08-17TNone",
        "end": "2025-08-17TNone",
        "extendedProps": {
            "description": "The Group for Rural Activities (GRA) invites you to 'Gram Bhraman', an extraordinary rural exploration camp and field visit to Mamnoli, Kalyan, scheduled for 17th August, 2025. This immersive experience offers a dive into village life amidst lush greenery, alongside insights from Samatol foundation, an NGO working in child rehabilitation. Participants will engage in village exploration, a round table discussion with Vijay Jadhav (founder of Samatol foundation), and direct interaction with children rehabilitated by Samatol. Samatol foundation aims to reunite abandoned/orphaned kids with their families, having successfully reunited over 15000 children. Note: This initiative is not for UG Freshers (2025 UG entrants).",
            "venue": "Mamnoli, Kalyan",
            "organisingBody": "GRA, IIT Bombay",
            "contact": "Archishman Ray (9831876729), Tanushree (7850869073)"
        }
    },
    {
        "title": "63rd Convocation and Departmental Degree Award Function (DDAF) of the Institute",
        "start": "2025-08-23TNone",
        "end": "2025-08-24TNone",
        "extendedProps": {
            "description": "Invitation to the 63rd Convocation and Departmental Degree Award Function (DDAF) of the Institute.",
            "venue": null,
            "organisingBody": "Indian Institute of Technology Bombay",
            "contact": "Umesh Korade, Deputy Registrar (Acad), Tele: 022-25767041"
        }
    },
    {
        "title": "Central Library Book and e-Book Exhibition",
        "start": "2025-08-18T11:00:00",
        "end": "2025-08-24T11:00:00",
        "extendedProps": {
            "description": "A spectacular Book and e-Book Exhibition showcasing an extensive collection of cutting-edge publications across a wide spectrum of subjects from esteemed Publishers and Vendors. The primary objective is to foster a culture of reading and promote the acquisition of enlightening and valuable books. Publishers and vendors are offering generous discounts of up to 50%.",
            "venue": "First Floor of the Central Library",
            "organisingBody": "Central Library",
            "contact": null
        }
    },
    {
        "title": "Movie Screening: Film Major (Independence Day 2025)",
        "start": "2025-08-15T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Major is a moving tribute to Major Sandeep Unnikrishnan, the braveheart who laid down his life during the 26/11 Mumbai attacks. The film beautifully portrays his journey -- from his childhood dreams to his heroic final mission -- and reminds us of the true meaning of service to the nation. This screening is not just about watching a film; it's about honoring a hero and reflecting on the values of duty, bravery, and selflessness. We encourage everyone to join us, bring along your friends, and immerse yourselves in a story that will leave you inspired and proud. Let's make this Independence Day truly memorable.",
            "venue": "LTPCSA",
            "organisingBody": "NCC IIT Bombay",
            "contact": "+91 9579242137, +91 6378959610"
        }
    },
    {
        "title": "India Open Hackathon - OPTIMIZE. ACCELERATE. SCALE",
        "start": "2023-09-22TNone",
        "end": "2023-09-26TNone",
        "extendedProps": {
            "description": "A unique opportunity to advance HPC & AI projects with the help of dedicated experts and seek collaboration with industry experts. This hackathon aims to help developers and research groups push their real-world projects forward by connecting participants with the latest technologies, robust tool sets, and collective expertise under the guidance of industry experts. Attendees will gain access to powerful leadership-class compute cluster systems with latest GPU architecture, NVIDIA and partner mentors, and certificates.",
            "venue": null,
            "organisingBody": "NVIDIA and the OpenACC organization",
            "contact": "Mr. Vivek Kumar Rai, Business Head, HPC & AI, NVIDIA South Asia, Mobile: +91 9028018738, Email: vivrai@nvidia.com"
        }
    },
    {
        "title": "Wellbeing Questionnaire for First-Year UG Students",
        "start": "2025-08-30T10:00:00",
        "end": "2025-08-30T10:00:00",
        "extendedProps": {
            "description": "The Student Wellness Centre (SWC) conducts an annual Wellbeing Questionnaire (WBQ) for all first-year UG students to support their well-being and ease adjustment to campus life. Participation is mandatory. Students are divided into batches with specific time slots: Batch 1 (10:00 am - 11:00 am): D1-T1, D2-T1, D3-T1, D4-T1 and D1-T2, D2-T2; Batch 2 (11:00 am - 12:00 pm): D3-T2, D4-T2 and D1-T3, D2-T3, D3-T3, D4-T3; Batch 3 (12:00 pm - 1:00 pm): D1-T4, D2-T4, D3-T4, D4-T4 and D1-T5 D2-T5; Batch 4 (2:30 pm - 3:30 pm): D3-T5, D4-T5 and D1-T6, D2-T6, D3-T6, D4-T6; Batch 5 (3:30 pm - 4:30 pm): D1-T7, D2-T7, D3-T7, D4-T7 and D1-T8, D2-T8; Batch 6 (4:30 pm - 5:30 pm): D3-T8, D4-T8 and D1-T9, D2-T9, D3-T9, D4-T9; Batch 7 (5:30 pm - 6:30 pm): B.Des.",
            "venue": "Software Lab, 2nd Floor, CC Building",
            "organisingBody": "Student Wellness Centre, IIT Bombay",
            "contact": "outreach.swc@iitb.ac.in"
        }
    },
    {
        "title": "Aazadi ke Rang, Vaani ke Sang",
        "start": "2025-08-14T18:00:00",
        "end": "NoneT18:00:00",
        "extendedProps": {
            "description": "An evening organized by Vaani Club to honor India's journey through words, marking the 79th Independence Day. The event features an Open Mic where students and professors can share poetry or thoughts on patriotism. All are welcome to perform or attend.",
            "venue": "Theatre room, Old SAC",
            "organisingBody": "Vaani Club",
            "contact": "Mohammad Zaif Ansari, Institute Indian Languages Secretary, 8140275394; Aditya Sisodiya, General Secretary, Cultural Affairs, IIT Bombay, +91 79991 57905"
        }
    },
    {
        "title": "Hindi Language Course",
        "start": "2025-08-19T16:30:00",
        "end": "NoneT16:30:00",
        "extendedProps": {
            "description": "The International Relations Office is introducing a Hindi Language Course, primarily aimed at foreign students, but also open to Indian students and staff members.",
            "venue": "On-campus, in person",
            "organisingBody": "International Relations Office",
            "contact": "international@iitb.ac.in"
        }
    },
    {
        "title": "National Level Online Quiz: Independence Day",
        "start": "2025-08-15T16:00:00",
        "end": "2025-08-15T16:00:00",
        "extendedProps": {
            "description": "The Bureau of Indian Standards (BIS), under the Ministry of Consumer Affairs, Food & Public Distribution, Government of India, is organizing a National Level Online Quiz exclusively for BIS MoU partner institutes to test knowledge and celebrate the spirit of Independence Day.",
            "venue": "Online",
            "organisingBody": "Bureau of Indian Standards (BIS)",
            "contact": null
        }
    },
    {
        "title": "UPSC Talks with IITB Alumni",
        "start": "2025-08-17T15:00:00",
        "end": "NoneT15:00:00",
        "extendedProps": {
            "description": "We are pleased to announce the upcoming edition of the UPSC Talks, an event designed to provide valuable insights into one of India's most prestigious and challenging examinations, the UPSC Civil Services Examination. The session will feature distinguished IIT Bombay alumni, who will share their personal journeys, preparation strategies, and perspectives on serving the nation through the civil services. Attendees can expect direct guidance from alumni, interactive Q&A, practical insights into preparation, and networking opportunities with peers and mentors.",
            "venue": "F.C. Kohli Auditorium",
            "organisingBody": "Student Alumni Relations Cell, IIT Bombay",
            "contact": "Parth Dhruv (SARC CTM): 99049 59162, Sarvagya Jain (SARC CTM): 94248 00631"
        }
    },
    {
        "title": "Sohrai Folk Art Workshop - Roots 10th Birthday Celebration",
        "start": "NoneT15:00:00",
        "end": "NoneT15:00:00",
        "extendedProps": {
            "description": "As part of Roots’ 10th Anniversary celebrations, this Independence Day, we invite you to an exclusive Sohrai Folk Art workshop & exhibition led by Ms. Vidisha Pandey, a master of this beautiful tribal tradition. All materials will be provided, just bring your creativity! Join us as we celebrate a decade of nurturing India’s classical and folk arts within our institute, and immerse yourself in the colors of tradition this Independence Day.",
            "venue": "SOM Well",
            "organisingBody": "Roots – Institute Classical and Folk Arts Club",
            "contact": "Aditya Sisodiya, +91 79991 57905"
        }
    },
    {
        "title": "IITB Staff Excellence Awards Function",
        "start": "2025-08-15T10:15:00",
        "end": "2025-08-15T10:15:00",
        "extendedProps": {
            "description": "The IIT Bombay Staff Excellence Awards will be conferred to the awardees on 15 August 2025 following the Independence Day celebrations. Consistent and silent contributions of our non-teaching officers and staff are strong support to sustained excellence of IIT Bombay. In order to appreciate and recognize their efforts, you are cordially invited to IITB Staff Excellence Awards Function to felicitate the first batch of awardees. We look forward to your participation in celebrating the consistent contributions of our non-teaching officers and staff.",
            "venue": "B Nag Auditorium, VMCC Ground Floor",
            "organisingBody": "Dean (Administrative Affairs), IIT Bombay",
            "contact": "dean.aa@iitb.ac.in"
        }
    },
    {
        "title": "Inter IIT Pre-Camp Trials",
        "start": "2023-08-17T10:00:00",
        "end": "2023-09-27T10:00:00",
        "extendedProps": {
            "description": "Practice sessions and selection trials for various sports (Athletics, Badminton, Basketball, Chess, Cricket, Football, Hockey, Lawn Tennis, Squash, Table Tennis, Volleyball, Weightlifting) to identify and nurture promising athletes for the 58th Inter-IIT Sports Meet. Students must register via the provided Google Form and adhere to sport-specific instructions.",
            "venue": "Multiple venues across IIT Bombay campus as per sport (e.g., Athletics synthetic track, Indoor badminton court, New SAC, Football Turf)",
            "organisingBody": "Institute Sports Council, IIT Bombay",
            "contact": "Rajwardhan Toraskar, General Secretary, Sports Affairs, IIT Bombay; Phone: +91 9619000065; Website: gymkhana.iitb.ac.in/sports/"
        }
    },
    {
        "title": "HPCL-IITB Energy Transition Challenge",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The HPCL-IITB Energy Transition Challenge, jointly organized by Hindustan Petroleum Corporation Limited (HPCL), the Research Hub for Green Energy and Sustainability (GESH IITB), and the Centre of Excellence in Oil, Gas, and Energy (CoE-OGE IITB), aims to engage bright minds like students, startups, researchers, and refinery professionals in ideating practical, scalable, and disruptive solutions for decarbonizing refinery operations and processes. The theme is \"Energy Transition in Refineries through Innovation\". Participants can win cash prizes up to ₹60,000. Eligibility for Track 1 includes startups and students from IITs, participating as individuals or in teams of up to 4 members.",
            "venue": null,
            "organisingBody": "Hindustan Petroleum Corporation Limited (HPCL), Research Hub for Green Energy and Sustainability (GESH IITB), Centre of Excellence in Oil, Gas, and Energy (CoE-OGE IITB)",
            "contact": "Ms. Jaya K, 30006497@iitb.ac.in"
        }
    },
    {
        "title": "Tools of Analytics: Power BI Workshop",
        "start": "NoneT18:30:00",
        "end": "NoneT18:30:00",
        "extendedProps": {
            "description": "We're excited to host a workshop on Power BI, a powerful business intelligence tool that transforms raw data into interactive dashboards and actionable insights. This session will cover Power BI fundamentals - data import, cleaning, visualization, dashboard creation and will showcase real world industry applications. The workshop will be conducted by Mr. Arijit Chowdhury, Senior VP at YES Bank. Drawing on his hands-on expertise, he will share best practices, tips, and tricks to help you make the most of Power BI’s features. The session will be followed by a certification assignment intended to assess the understanding of topics discussed. Participants who successfully complete the assignment will be awarded a certificate of completion.",
            "venue": "LC 001",
            "organisingBody": "Analytics Club, IIT Bombay",
            "contact": "Aryan Kashyap, Manager, Analytics Club, 6206443759, analyticsclub@iitb.ac.in"
        }
    },
    {
        "title": "Extended services of SWC: Counsellor on call",
        "start": "2025-08-16T11:00:00",
        "end": "2025-08-17T11:00:00",
        "extendedProps": {
            "description": "Counsellor on call will be available for one-on-one emotional support. Students can walk in to the SWC office or contact via phone (Institute extension 9070) or email (wellness@iitb.ac.in).",
            "venue": "SWC Office (Nandan Nilekani Main Building, 3rd floor)",
            "organisingBody": "Student Wellness Centre, IIT Bombay",
            "contact": "Phone: 9070 (Institute extension), Email: wellness@iitb.ac.in"
        }
    },
    {
        "title": "Team ChemEca IIT Bombay Recruitment Test",
        "start": "2025-08-18T20:30:00",
        "end": "2025-08-18T20:30:00",
        "extendedProps": {
            "description": "Recruitment test for motivated UG Sophomores to join Team ChemEca IIT Bombay. The test aims to assess basic understanding of PCM subjects, thoughtfulness, resourcefulness, and problem-solving ability. Prior knowledge or experience is not required. Candidates can attempt tests for multiple subsystems. Shortlisted candidates will proceed to interview rounds. Participants are required to bring their laptops.",
            "venue": "LC 102",
            "organisingBody": "Team ChemEca IIT Bombay",
            "contact": "chemeca.iitb@gmail.com"
        }
    },
    {
        "title": "English Language Improvement Training (ELIT) Orientation",
        "start": "2024-08-19T17:30:00",
        "end": "2024-08-19T17:30:00",
        "extendedProps": {
            "description": "ELIT's (English Language Improvement Training) orientation is designed to improve language fluency, interpersonal, and soft skills. It is open for all and will feature exciting activities for an engaging and fun English learning journey.",
            "venue": "LA201",
            "organisingBody": "ELP Cabinet, English Learning Program (ELP), Student Mentor Program (SMP), IIT Bombay",
            "contact": "Aditya Rana, Ayush Jaiswal (Cabinet Heads, ELP); +91-9692894061, +91-7974399532; elp.cabinet.smp@gmail.com"
        }
    },
    {
        "title": "UPSC Talks",
        "start": "2025-08-17T15:00:00",
        "end": "2025-08-17T15:00:00",
        "extendedProps": {
            "description": "An insightful session on the UPSC Civil Services Examination featuring distinguished IIT Bombay alumni. Speakers will share first-hand perspectives on the UPSC journey, effective preparation strategies, and inspiring stories of determination and achievement.",
            "venue": "F.C. Kohli Auditorium",
            "organisingBody": "Student Alumni Relations Cell, IIT Bombay",
            "contact": "Parth Dhruv | SARC CTM | 99049 59162, Sarvagya Jain | SARC CTM | 94248 00631"
        }
    },
    {
        "title": "Krittika Summer Projects 6.0 Presentation",
        "start": "2025-08-17T21:00:00",
        "end": "2025-08-17T21:00:00",
        "extendedProps": {
            "description": "Krittika - the Astronomy Club of IIT Bombay, invites you all to the Krittika Summer Projects (KSP) 6.0 presentation session. Every summer, we run a range of exciting astrophysics projects through KSP – one of the largest student-led programs of its kind in the country. This year’s edition brought together passionate mentees and mentors to explore diverse and challenging topics in astronomy and astrophysics. The following are the specific domains of research covered: 1. Gamma Ray Bursts: Theory and Data Analysis 2. Imaging a Bright Neutron Star and a Magnificent Radio Galaxy 3. Design and analysis of radomes for next-generation radio astronomy experiments 4. Thermonuclear Bursts in Neutron Star X-ray Binaries 5. Visualising Geodesics in Schwarzschild Spacetime 6. Bangs, Blips, or Background: Decoding GRB Signals. Now, after weeks of learning, collaboration, and discovery, our mentees are ready to present their work! Come witness their journey, engage with the projects, and celebrate the spirit of curiosity that drives our community.",
            "venue": "Online: Meeting link: https://teams.microsoft.com/l/meetup-join/19%3ameeting_ZGI5MThmMzItMmM2NC00NDZhLTk1MDEtNjRjNGM3Mjk4YjQ2%40thread.v2/0?context=%7b%22Tid%22%3a%22403ee5f4-55b3-45cd-8ae2-824be887a075%22%2c%22Oid%22%3a%22a234b6fb-6003-48d1-a688-57463bca0bf7%22%7d, Meeting ID: 435 257 550 894 3, Passcode: sd2KK2As",
            "organisingBody": "Krittika - the Astronomy Club of IIT Bombay",
            "contact": "Team Krittika: Yash Palwe (99709 73860), Anvit Khade (99877 99311). Shahu Patil, General Secretary Technical Affairs 25-26, IIT Bombay (+91 91460 50850)."
        }
    },
    {
        "title": "HPCL-IITB Energy Transition Challenge",
        "start": "NoneTNone",
        "end": "2025-08-19TNone",
        "extendedProps": {
            "description": "An ideation challenge inviting bright minds to propose practical, scalable, and disruptive solutions for 'Energy Transition in Refineries through Innovation.' Participants can drive innovation, contribute to Net-Zero goals, collaborate with industry, and win cash prizes up to ₹60,000. Eligibility (Track 1): Startups and students from IITs (individual or teams up to 4).",
            "venue": null,
            "organisingBody": "Hindustan Petroleum Corporation Limited (HPCL), Research Hub for Green Energy and Sustainability (GESH IITB), Centre of Excellence in Oil, Gas, and Energy (CoE-OGE IITB)",
            "contact": "Ms. Jaya K, Senior Associate - Entrepreneurship, GESH IITB, 30006497@iitb.ac.in"
        }
    },
    {
        "title": "Acting Auditions for SOPHIEPROD",
        "start": "2023-08-17T19:00:00",
        "end": "2023-08-18T19:00:00",
        "extendedProps": {
            "description": "Auditions for Sophieprod, a highly anticipated showcase of plays. Enthusiastic actors are invited to audition for an unforgettable theatrical experience and a chance to be part of the INTER IIT DRAMATICS CONTINGENT. No mandatory past experience is required; open to seasoned actors and newcomers. An excellent opportunity to display acting skills and contribute to diverse performances. WhatsApp group for excerpts: https://chat.whatsapp.com/KVSdzJiV3WmCK5Dh8rXQrR (Note: WhatsApp Communities are not for freshers. Similar events for UG freshers will be planned later.)",
            "venue": "Theatre Room, Old SAC",
            "organisingBody": "Institute Dramatics / Cultural Affairs, IIT Bombay",
            "contact": "Omprakash Chaturvedi (Institute Dramatics Secretary): 7972643853, Aditya Sisodiya (General Secretary, Cultural Affairs, IIT Bombay): +91 79991 57905"
        }
    },
    {
        "title": "Registrations Open for Salsa Night 2025 Opening Performances",
        "start": "NoneTNone",
        "end": "2024-08-18TNone",
        "extendedProps": {
            "description": "Registrations for the Opening Performances are now open for UG Sophomores and PG Freshers. This is your chance to be a part of one of the most magical nights of the year and showcase your talent on stage!",
            "venue": null,
            "organisingBody": "InSync",
            "contact": "Harshita Kumar (+91 9589375565), Aditya Sisodiya (+91 79991 57905)"
        }
    },
    {
        "title": "Central Library Book and e-Book Exhibition cum sale",
        "start": "2025-08-18T11:00:00",
        "end": "2025-08-24T11:00:00",
        "extendedProps": {
            "description": "Central Library is excited to announce a spectacular Book and e-Book Exhibition scheduled to run for seven consecutive days from 18th to 24th August 2025. This literary extravaganza will take place on the First Floor of the Central Library. During this exhibition, esteemed Publishers and Vendors from various domains will come together to showcase an extensive collection of cutting-edge publications across a wide spectrum of subjects: a) Engineering, Sciences, and Technology b) Bio-Sciences, Bio-engineering, and Bio-technology c) Economics and Management d) Humanities and other Social Sciences e) Arts and Design f) General collections, encompassing novels, biographies, and more g) Children's Books, sourced from reputable Publishers, including Universities, Professional Societies, and Associations. The primary objective of this book exhibition is to foster a culture of reading and promote the acquisition of enlightening and valuable books. As a special offer, publishers and vendors are offering generous discounts of up to 50%. Users are encouraged to avail themselves of this remarkable opportunity, whether for personal purchase or to recommend titles for inclusion in the library's collection. Join us at the Central Library's Book and e-Book Exhibition and embark on a journey through the world of knowledge and imagination. Don't miss out on the chance to explore, discover, and enrich your personal and academic pursuits. We look forward to welcoming you from 18-24 August 2025 at the First Floor of the Central Library. Opening Day (18 August 2025): 11:00 am - 8:00 pm. 19-24 August 2025: 10:00 am - 8:00 pm. The following publishers and vendors will be participating in the Print/Electronic resources Exhibition/display and sale. Print Books Publishers/Vendors: Feel Books (P) Ltd (Print + Online), Millennium Enterprises, Overseas Press India Pvt. Ltd, T. V. Enterprises, Vakratund Book House, CBS Publishers and Distributors Pvt. Ltd., Sita Books, Packt, New Age International (P) Ltd. Online Publishers/Vendors: Balani Infotech Pvt. Ltd., IOP Publishing Ltd., BSB Edge, Wolters Kluwer, Pearson India Education Services Pvt. Ltd.",
            "venue": "First Floor of the Central Library",
            "organisingBody": "Central Library",
            "contact": null
        }
    },
    {
        "title": "HSBC Session on Careers in Banking and Case Competition Workshop",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": null,
            "venue": null,
            "organisingBody": "Career Cell | Consult Club | UGAC",
            "contact": null
        }
    },
    {
        "title": "Zumba and Pilates Classes Registration",
        "start": "2025-08-25T17:30:00",
        "end": "NoneT17:30:00",
        "extendedProps": {
            "description": "Registrations are open for Zumba and Pilates classes offered by the Institute Sports Council. Zumba is a high-energy fitness program combining music with dance moves, designed to improve cardiovascular health, coordination, and overall fitness. Pilates focuses on strengthening the body with an emphasis on core stability, posture, flexibility, and controlled movement. Both programs are suitable for beginners and experienced fitness enthusiasts and will run Mon-Wed-Fri.",
            "venue": "Screening room, 3rd floor (New SAC, opp. Hostel-11)",
            "organisingBody": "Institute Sports Council, IIT Bombay",
            "contact": "Piyush, Fitness Club Manager, +91 9479591296"
        }
    },
    {
        "title": "MoU signing between SINE IITB and Monash University",
        "start": "2025-08-22T11:45:00",
        "end": "2025-08-22T11:45:00",
        "extendedProps": {
            "description": "The MoU will signal the launch of a partnership committed to supporting start-up talent, commercialisation opportunities, and to strengthen ties between Australia and India’s start-up ecosystem and innovation networks.",
            "venue": "IITB Monash Research Academy Atrium",
            "organisingBody": "SINE IITB and Monash University",
            "contact": "partnerships@sineiitb.org"
        }
    },
    {
        "title": "Calisthenics Sessions",
        "start": "2025-08-20T19:30:00",
        "end": "NoneT19:30:00",
        "extendedProps": {
            "description": "We’re excited to announce the start of regular Calisthenics sessions, open to everyone looking to build strength, improve flexibility, and master bodyweight training. Whether you're a beginner or experienced in fitness, these sessions will guide you through structured routines including push-ups, pull-ups, squats, core training, and skill progressions like muscle-ups and levers – all with minimal equipment.",
            "venue": "Screening room, 3rd floor (New SAC, opp. H11)",
            "organisingBody": "Institute Sports Council",
            "contact": "Piyush, +91 9479591296"
        }
    },
    {
        "title": "Teqball Workshop",
        "start": "NoneT17:15:00",
        "end": "NoneT17:15:00",
        "extendedProps": {
            "description": "The Institute Sports Council invites you to experience Teqball, a modern sport combining football and table tennis elements, played on a curved Teq table. It can be played in singles or doubles, testing skill and reflexes by passing the ball with any body part except hands and arms.",
            "venue": "Indoor Cricket Nets",
            "organisingBody": "Institute Sports Council",
            "contact": "Deepraj Singh Kasherwal, Institute Basketball Secretary, Ph: +91 9761543343"
        }
    },
    {
        "title": "Introduction to Sanskrit Language Course",
        "start": "2025-08-21T20:30:00",
        "end": "2025-08-25T20:30:00",
        "extendedProps": {
            "description": "This course is specially designed for beginners, and no prior knowledge of Sanskrit is required. Participants will be introduced to the fundamentals of the language in a simple and engaging manner, making it accessible to everyone. We warmly encourage students, faculty, and staff to take this opportunity to explore the richness of Sanskrit through this introductory course.",
            "venue": null,
            "organisingBody": "Centre for Sanskrit Learning, IIT Bombay",
            "contact": "Mr. Pranav Gogate at +91 8007889485"
        }
    },
    {
        "title": "63rd Convocation and Departmental Degree Award Function (DDAF)",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "This email provides information regarding the 63rd Convocation and the Departmental Degree Award Function (DDAF). It states that the DDAF schedule is attached (not provided in the email content) and advises students to contact their respective Department Office for the exact time. It also mentions that a new Uttaria can be issued for Rs. 400/- at the Cash Section if lost or misplaced.",
            "venue": null,
            "organisingBody": "Dean / Associate Dean Academic Programmes",
            "contact": "respective Department Office"
        }
    },
    {
        "title": "English Language Improvement Training (ELIT) Orientation",
        "start": "2025-08-19T17:30:00",
        "end": "2025-08-19T17:30:00",
        "extendedProps": {
            "description": "ELIT classes are designed to improve your language fluency and interpersonal and soft skills. It is open for all, anyone can join in! Get ready for a lineup of exciting activities that are carefully planned to make your English learning journey engaging and fun! Join our whatsapp group to get more updates - https://chat.whatsapp.com/Ll1l4JsSTgtFi12lAWyrS2?mode=ac_t You can also follow us on instagram to know more about other events conducted by ELP - https://www.instagram.com/elp.iitb",
            "venue": "Online (Microsoft Teams Meet Link): https://teams.microsoft.com/meet/4200210268297?p=tlmWPDcqsMj21Ehg4N",
            "organisingBody": "English Learning Program (ELP) / Student Mentor Program (SMP), IIT Bombay",
            "contact": "Aditya Rana | Ayush Jaiswal, Cabinet Heads, ELP, SMP, IIT Bombay. Phone: +91-9692894061 | +91-7974399532. Email: elp.cabinet.smp@gmail.com"
        }
    },
    {
        "title": "GRE & TOEFL Session Registration",
        "start": "2025-08-22T18:00:00",
        "end": "2025-08-22T18:00:00",
        "extendedProps": {
            "description": "A one-hour session offering invaluable insights and strategies to confidently approach the GRE and TOEFL exams. Exclusive discount codes from ETS India will be provided to attendees.",
            "venue": null,
            "organisingBody": "ELP Cabinet and Career Cell, UGAC (in collaboration with ETS India and University of Cambridge)",
            "contact": "elp.cabinet.smp@gmail.com, careercell@iitb.ac.in"
        }
    },
    {
        "title": "The Starttup Lab: Personalized Mentoring Sessions",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "IIC, in collaboration with DSSE, is offering personalized mentoring sessions for individuals / teams which are at various stages of venture creation. The first such session will be conducted on \"World Entrepreneurs Day\" on 21st August. You will need to fill up a google form to book a slot.",
            "venue": null,
            "organisingBody": "IIC, DSSE, IIT Bombay",
            "contact": "Mr Sanjay Kaharat"
        }
    },
    {
        "title": "Inter IIT Pre-Camp Trials for Athletics & Football (Revised Schedule)",
        "start": "2025-08-22T18:00:00",
        "end": "2025-08-25T18:00:00",
        "extendedProps": {
            "description": "Due to heavy rains, the Inter IIT Pre-Camp Trials for Athletics and Football have been postponed. Please find the revised schedule below: Athletics Trials Date: 25th August 2025 Time: 6:00 PM onwards Venue: Athletics Synthetic Track Football Trials Date: 22nd August 2025 Time- 7:30 PM to 9:30 PM Venue- Football Turf We kindly request all concerned players to take note of the updated dates and timings and be present accordingly.",
            "venue": "Athletics Synthetic Track, Football Turf",
            "organisingBody": "Institute Sports Council, IIT Bombay",
            "contact": "Praveen Kumar, Institute Athletics Secretary, Ph: +918958434190"
        }
    },
    {
        "title": "Inter IIT Pre-Camp Football Trials",
        "start": "2025-08-26T19:30:00",
        "end": "2025-08-26T19:30:00",
        "extendedProps": {
            "description": "Revised schedule for the Football trials for the Inter IIT Pre-Camp, previously postponed due to heavy rains. Please note the updated date and time for the trials.",
            "venue": "Football Turf",
            "organisingBody": "Institute Sports Council, IIT Bombay",
            "contact": "Praveen Kumar, +918958434190"
        }
    },
    {
        "title": "UK Government's Fully-Funded Chevening Scholarships & Fellowships Virtual Awareness Session",
        "start": "2025-08-26T15:00:00",
        "end": "2025-08-26T15:00:00",
        "extendedProps": {
            "description": "Online session providing insights on eligibility, the application process, and tips for success for Chevening Scholarships and Fellowships. Attendees can ask questions directly to the Head of Chevening.",
            "venue": "Virtual",
            "organisingBody": "British High Commission",
            "contact": "Akriti Arora, akriti.arora@fcdo.gov.uk"
        }
    },
    {
        "title": "Inter IIT Aquatics Girls Swimming Trials",
        "start": "2025-08-22T18:30:00",
        "end": "NoneT18:30:00",
        "extendedProps": {
            "description": "The Aquatics Club of IIT Bombay will be conducting girls swimming trials as part of the pre-camp selections for the upcoming Inter IIT Aquatics Meet. These trials present a valuable opportunity to be a part of the IIT Bombay contingent and compete at the Inter IIT Sports Meet. Selected students will undergo structured training and gain exposure to high-level competition while representing IIT Bombay. The Inter IIT Aquatics Meet will be held from 30th September to 4th October 2025 at IIT Madras, as part of the Inter IIT Sports Meet.",
            "venue": "Institute Swimming Pool (in front of Hostel 2)",
            "organisingBody": "Aquatics Club of IIT Bombay",
            "contact": "Meet Vanja, Institute Aquatics Secretary, +91 9323587701"
        }
    },
    {
        "title": "Swimming Preparatory Camp",
        "start": "2023-08-25TNone",
        "end": "2023-09-04TNone",
        "extendedProps": {
            "description": "The Institute Sports Council is organizing a Swimming Preparatory Camp, part of an ongoing series of Aquatics Camps, to teach swimming. The camp runs from August 25th to September 4th. It offers three distinct sessions: an Intermediate Camp (7:15 AM - 8:00 AM, Basic Freestyle necessary, capacity 30), a Girls Beginners Camp (5:30 PM - 6:15 PM, capacity 30), and a Boys Beginner Camp (7:00 PM - 7:45 PM, capacity 30). Each session costs Rs 100/-. Registration is required via Google Forms.",
            "venue": null,
            "organisingBody": "Institute Sports Council, IIT Bombay",
            "contact": "Meet Vanja, Institute Aquatics Secretary - 9323587701; Rajwardhan Toraskar, General Secretary, Sports Affairs, IIT Bombay - +91 9619000065"
        }
    },
    {
        "title": "Eco-Friendly Ganesha Workshop",
        "start": "2025-08-24T10:00:00",
        "end": "2025-08-24T10:00:00",
        "extendedProps": {
            "description": "A hands-on workshop by NSS IIT Bombay where participants will craft their own eco-friendly clay Ganesha idols, blending devotion with sustainability.",
            "venue": "Yoga Room, 2nd Floor, New SAC",
            "organisingBody": "NSS IIT Bombay",
            "contact": "Vedika Sarode (8657500288), Ashish Singh (8269131466)"
        }
    },
    {
        "title": "Introduction to Sanskrit Language Course",
        "start": "2025-08-21T20:30:00",
        "end": "2025-08-25T20:30:00",
        "extendedProps": {
            "description": "This course is specially designed for beginners, and no prior knowledge of Sanskrit is required. Participants will be introduced to the fundamentals of the language in a simple and engaging manner, making it accessible to everyone. We warmly encourage students, faculty, and staff to take this opportunity to explore the richness of Sanskrit through this introductory course.",
            "venue": "LC 301",
            "organisingBody": "Centre for Sanskrit Learning, IIT Bombay",
            "contact": "Mr. Pranav Gogate at +91 8007889485"
        }
    },
    {
        "title": "SPM@MEMS - training workshop on c-AFM/PFM/KPFM",
        "start": "2025-09-09TNone",
        "end": "2025-09-12TNone",
        "extendedProps": {
            "description": "A training workshop on the Scanning Probe Microscope (SPM@MEMS) Central Facility for conductive-AFM/PFM/KPFM/EFM. Interested candidates are requested to fill out a form; selections will be made from the pool, with existing TAs given preference.",
            "venue": "SPM@MEMS Central Facility",
            "organisingBody": "Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay",
            "contact": "Tanushree Choudhury <tanuhc@iitb.ac.in>"
        }
    },
    {
        "title": "National Space Day Celebrations",
        "start": "2025-08-22T10:00:00",
        "end": "2025-08-23T10:00:00",
        "extendedProps": {
            "description": "A celebration of National Space Day organized by Krittika, IIT Bombay. The event includes distinguished guest lectures on 'The Earliest Stars and How We Study Them' and 'The Journey of Astrophotography – From Photon to Photograph'.",
            "venue": "New CC, Entrance Foyer",
            "organisingBody": "Krittika, IIT Bombay",
            "contact": "Yash Palwe: 9970973860, Anvit Khade: 9987799311, Shahu Patil: +919146050850"
        }
    },
    {
        "title": "Book Issuance from Technology Lending Library (Book Bank)",
        "start": "2025-09-01T09:30:00",
        "end": "2025-09-04T09:30:00",
        "extendedProps": {
            "description": "The Central Library is issuing books from the Technology Lending Library (Book Bank) to UG students. Eligibility criteria vary for economically weaker section students (parents' income below taxable limit or eligible for MCM Scholarship) and general category students. Eligible students can borrow 5 books for Rs. 51/-, and general category students can borrow remaining books for Rs. 91/-. Books must be returned by the end of the semester. Students must carry a valid Institute Identity Card.",
            "venue": "Ground Floor, Circulation Section",
            "organisingBody": "Central Library",
            "contact": null
        }
    },
    {
        "title": "Book Issuance from Book Bank for SC/ST Students",
        "start": "2025-08-25T09:30:00",
        "end": "2025-08-29T09:30:00",
        "extendedProps": {
            "description": "Central Library has a facility to issue 5 text books per semester from the Book Bank to eligible SC/ST undergraduate students. These books must be returned before the end of the semester. Students whose names appear in the list of SC/ST students received from the Academic Office are eligible. Please carry your valid Institute Identity Card.",
            "venue": "Ground Floor, Circulation Section",
            "organisingBody": "Central Library",
            "contact": "Central Library"
        }
    },
    {
        "title": "Seed Stars 2025: IITB Track - Unlock Funding Opportunities",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "Seed Stars is a 3 month long cohort which brings together India's top pre-seed and seed-stage startups with leading VCs and institutional investors. As a dynamic funding arena, it offers live pitches, rich mentorship opportunities, cohort programs and direct investor engagement. This exclusive track is designed to spotlight startups from IIT Bombay, giving you a powerful stage to: Pitch to top-tier VCs and Investors, 4-week intensive cohort with industry experts, Access flexible funding on your own terms, Gain hands-on mentorship from industry leaders, Expand your network across India's startup ecosystem, Boost your startup's credibility with the IITB tag.",
            "venue": null,
            "organisingBody": "E-Cell, IIT Bombay",
            "contact": "Ishant Singh: +91 85120 94092, Amit Bhartiya: +91 78784 69798"
        }
    }
]