[
    {
        "title": "Central Library Orientation 2025",
        "start": "2025-08-04T10:00:00",
        "end": "2025-08-08T10:00:00",
        "extendedProps": {
            "description": "Detailed Library Orientation Program for new entrants and senior students interested in learning more about library resources and services.  Covers access to digital resources, research support, and library events.",
            "venue": "Conference Hall, 2nd Floor, Central Library",
            "organisingBody": "Central Library",
            "contact": "+91-22-2576-8936 / 8926"
        }
    },
    {
        "title": "Roshni: Bringing the Light of Rural Artistry",
        "start": "2025-08-04T11:00:00",
        "end": "2025-08-05T11:00:00",
        "extendedProps": {
            "description": "An initiative by the Group for Rural Activities (GRA) to connect students with rural Indian artisans.  Features online ordering and an offline exhibition of handcrafted items like Bamboo Rakhis, Key Chains, Notebooks, Side Bags, Jewellery, etc.  Proceeds support rural artisans and promote sustainable crafts.",
            "venue": "Hostels 10, 11, and 15 mess areas (7:30 PM to 9:30 PM), Staff Canteen (11:00 AM to 5:00 PM)",
            "organisingBody": "Group for Rural Activities (GRA), IIT Bombay",
            "contact": "9831876729 || 7850869073"
        }
    },
    {
        "title": "ShARE IITB Orientation",
        "start": "2025-08-03T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "Orientation for ShARE IITB, a student-run leadership and consulting organization.  Includes information about their recruitment process, a guest speaker (Jahnvi Nandwani), fun activities, and prizes. Winners of ShARE's Business Challenge will be announced.",
            "venue": "LT-PCSA",
            "organisingBody": "ShARE IITB, UGAC",
            "contact": "https://www.shareiitb.org/"
        }
    },
    {
        "title": "Student Vaccination Drive",
        "start": "2025-08-03T09:15:00",
        "end": "2025-08-03T09:15:00",
        "extendedProps": {
            "description": "Vaccination drive for students.  MMR, Chicken Pox, Typhoid, and Hepatitis A vaccines are offered. Paid basis (Administration Charges + Vaccine Charges). Online payment only.  Verification of vaccine records for new students.",
            "venue": "Hospital new OPD wing",
            "organisingBody": "Bha.Prau.San. Hospital, CMO(SAG)",
            "contact": "Dr. Arvind Meshram"
        }
    },
    {
        "title": "Inter IIT Tech Meet 14.0",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "The largest annual tech showdown among all IITs—featuring mind-bending competitions, cutting-edge innovation, entrepreneurial brilliance, and tech-for-impact challenges.",
            "venue": null,
            "organisingBody": "Institute Technical Council, IIT Bombay",
            "contact": "+91 91460 50850"
        }
    },
    {
        "title": "Free Webinar for students looking to pursue higher studies in Germany",
        "start": "2025-08-06T16:00:00",
        "end": "NoneT16:00:00",
        "extendedProps": {
            "description": "Step-by-step admission process through the new Consular Service Portal\nOverview of preparatory programs for international students\nInformation on visa procedures, scholarships, and tuition\nOpportunity to ask questions live to our team",
            "venue": "Online",
            "organisingBody": "German Consulate General, Mumbai & Indian Institute of Technology (IIT) Bombay",
            "contact": "Rebecca Jadin, +91-22-21593069, http://www.ir.iitb.ac.in"
        }
    },
    {
        "title": "iGEM IIT Bombay Education Outreach Tech Team Recruitment",
        "start": "NoneTNone",
        "end": "2025-08-12TNone",
        "extendedProps": {
            "description": "Recruitment for sophomores (B.Tech, B.Des, and B.S. students) for two key roles within the Education Outreach Subsystem: Visual Communicator and Website UI/UX Designer.  No prior experience needed.",
            "venue": null,
            "organisingBody": "iGEM IIT Bombay",
            "contact": "+91 93405 94582 & +91 70233 89911"
        }
    },
    {
        "title": "LRWC Support Courses for Autumn Semester 2025",
        "start": "2025-08-04T13:00:00",
        "end": "2025-08-08T13:00:00",
        "extendedProps": {
            "description": "Language support courses offered by the Language Resource and Writing Centre (LRWC) including Academic Speaking for Researchers, Foundations of Academic Speaking, and Essentials for Academic Writing.  Personalized consultations also available.",
            "venue": "LRWC Desk (24x7 Reading Hall, Central Library)",
            "organisingBody": "Language Resource and Writing Centre (LRWC)",
            "contact": "lrwcinstructor@iitb.ac.in"
        }
    },
    {
        "title": "Condolence Meeting for Mr Rohit Sinha",
        "start": "2025-08-04T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A condolence meeting for Mr Rohit Sinha, who passed away recently, is scheduled.",
            "venue": "LA 001",
            "organisingBody": "Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay",
            "contact": "Dr. Ajay Singh Panwar, Head, Department of Metallurgical Engineering and Materials Science, Indian Institute of Technology Bombay, Phone: +91-22-2576 7600"
        }
    },
    {
        "title": "e-Yantra Robotics Competition (eYRC 2025-26)",
        "start": "NoneTNone",
        "end": "NoneTNone",
        "extendedProps": {
            "description": "e-Yantra Robotics Competition (eYRC 2025-26) is IIT Bombay's signature Project-Based Learning (PBL) robotics competition, now open for registrations. It invites participants to showcase talents in robotics and engineering, involving technologies such as Robot Operating System (ROS), Drone Control, Image Processing, 3D Designing, Embedded Systems, Control Systems Design, Field Programmable Gate Arrays (FPGAs) Programming, and Reinforcement Learning.",
            "venue": null,
            "organisingBody": "e-Yantra, IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Basic First Aid and CPR Training",
        "start": "2025-08-09T11:00:00",
        "end": "2025-08-09T11:00:00",
        "extendedProps": {
            "description": "Join us for a hands-on Basic First Aid and CPR Training session organized by the Fire & Safety Section, Office of Dean (IPS). This is a great opportunity to equip yourself with life-saving skills and be prepared to act in emergencies. The first 50 registrants will secure their spot on a first-come, first-served basis. This Raksha Bandhan, let us extend the bond of protection beyond tradition, by learning CPR and being there for someone when it matters most.",
            "venue": null,
            "organisingBody": "Fire & Safety Section, Office of Dean (IPS), Indian Institute of Technology Bombay",
            "contact": "Amit Kumar, Technical Officer, Fire and Safety Section, Office of Dean (IPS), IIT Bombay, Telephone: +91-22 21593050"
        }
    },
    {
        "title": "Independence Day Programme 2025",
        "start": "2025-08-15TNone",
        "end": "2025-08-15TNone",
        "extendedProps": {
            "description": "Official announcement for the Independence Day Programme and celebrations, inviting all to attend in person or via live webcast.",
            "venue": null,
            "organisingBody": "IIT Bombay",
            "contact": null
        }
    },
    {
        "title": "Samadhan 2025 – National Social Innovation Challenge",
        "start": "2025-08-18TNone",
        "end": "2025-11-08TNone",
        "extendedProps": {
            "description": "A national-level social innovation challenge organized by UPAY NGO, in collaboration with GRA, IIT Bombay. Participants form teams of 2-4 students to propose and refine solutions for real-world issues faced by street children across India, with mentorship from industry experts. Top teams will pitch at a national stage, with opportunities for cash prizes and potential implementation. Not open to UG Freshers (2025 UG entrants).",
            "venue": null,
            "organisingBody": "UPAY NGO, GRA, IIT Bombay",
            "contact": "Archishman Ray, Tanushree (Overall Coordinators, GRA, IIT Bombay), Phone: 9831876729, 7850869073"
        }
    },
    {
        "title": "Shashwat Panda Memorial Lecture",
        "start": "2025-08-08T17:00:00",
        "end": "NoneT17:00:00",
        "extendedProps": {
            "description": "A lecture by Ms. Rama Bijapurkar titled 'Understanding India's Household Consumption Story'.",
            "venue": "PC Saxena Auditorium",
            "organisingBody": "Office of Dean ACR",
            "contact": null
        }
    },
    {
        "title": "Fine Arts NOCS Trials",
        "start": "2025-08-06T18:30:00",
        "end": "2025-08-06T18:30:00",
        "extendedProps": {
            "description": "Important update regarding the Fine Arts NOCS trials previously announced. The trials will now be held only on 6th August 2025 from 6:30 PM to 8:00 PM at LC 301, Lecture Complex. Please note that there will be no trials on 7th August as mentioned earlier.",
            "venue": "LC 301, Lecture Complex",
            "organisingBody": "Institute Cultural Council",
            "contact": "Omprakash Chaturvedi (NSO Cultural Coordinator) - 7972643853"
        }
    }
]
